{"text": "We are Hiring! Exciting opportunity for software engineers to work with us.\n1. We are expanding rapidly across products and scale with our enterprise customers\n2. FIRST ones, and ONLY ones as of today, to go live with end to end selling\n3. Full control on product and customisations for Enterprises, product build bottoms up in-house Looking for 2 backend software engineers, with ownership and agency - as the first and foremost criteria. Go through the Job description for the rest of the details. Apply if this you. Look forward to interacting with you soon!\n…more\nBackend, Infra and Scaling with AI for most exciting startup from India\nJob by SalesAgents AI\nIndia (Remote)\nView job\nView job\n14\n2 comments"}
{"text": "🚀 We're still ! | at D3V 🎯 🚀 Thrilled to keep building across the stack! From designing responsive UIs to optimizing backend APIs, being a Developer means bridging the gap between ideas and execution. here : https://lnkd.in/gzHPk_XJ 🌟 is looking for a Dynamic & self driven Full Stack Developer join our growing team! …more\nFullStack Developer\nJob by D3V Technology Solutions\nBengaluru, Karnataka, India (Remote)\nView job\nView job\n3\n2 comments"}
{"text": "Product Based Position: Java Full Stack Developer(React)\nExperience: 7-10 Years\nLocation: Bengaluru\nHybrid mode of working\nEmployment Type: Full-time\nNotice Period: Immediate joiners\nSkills: Core Java, Spring boot, React, Hibernate, Microservices, design patterns, Algorithms, API and Sql. Candidate must be available for Face to Face interview Interested candidates share your cv to rakesh@staragile.com …more\nFull Stack Developer(java and React)\nJob by StarAgile\nBengaluru, Karnataka, India (Hybrid)\nView job\nView job\n7\n1 comment\n2 reposts"}
{"text": "I'm : Sr Principal Architect/ SDE 🚨 Are you a Principal SDE ready to architect the future of digital health? 🚨\nWe’re building a state-of-the-art system for our digital portfolio—and I’m looking for a technical architect who thrives on designing scalable, world-class architectures. 🎯 You’re a fit if:\nYou’re a hands-on architect with deep database expertise\nYou love solving hard problems that matter\nYou’re ready to lead from the front This role reports directly to me. If you're that person, let’s connect. https://lnkd.in/gdHRDpVY\n…more\nDatabase Architect Job by Abbott\nLivermore, California, United States\nView job\nView job\n7"}
{"text": ": Java Architect – Core Backend (Spring Boot) 🚀 📍 Location: Plano, TX (12 months contract) ✅ Final Round: Face-to-Face Interview (Local or TX-based candidates only)\nWe’re looking for an experienced Senior Java Spring Boot Developer/Architect to design and build next-generation microservices-based solutions. If you excel in Java, Spring Boot, DDD, REST APIs, CI/CD, Docker/Kubernetes and thrive in solving complex technical challenges—this is for you!\n📧 Share your resume at: sachin.tyagi@kosmixit.com …more\n2\n1 comment"}
{"text": "Hiring (Immediate Joiners Needed!) We're urgently looking for people who can start immediately at an American company. Apply for Referral:- +91 8209701121 Last Date:- 28/08/2025 We welcome both and . Open positions- Full Stack Developer - , Developer, Developer, Designer, , Social Media Manager, Business Development Associate & : 0-3 years hours: Flexible : 16,000- 45,000 / Monthly in hand : Remote Work schedule: 5 days a week Training will be provided for . Note: Please respond only to personal replies, not anonymous messages. Comment \" \" to get shortlisted within 24 hours.\n…more\nActivate to view larger image,\nActivate to view larger image,"}
{"text": "ONLY Interested in joining this group?\n🚀 We’re Hiring: Web Developer / Web App Developer Join our team to build modern, scalable, and user-friendly web applications!\n📍 [Remote / Location] | 🕒 [Full-time / Contract] What we’re looking for: Experience with HTML, CSS, JS & frameworks like React/Vue API integration & back-end basics Passion for clean, efficient code 💼 Flexible work | Growth opportunities | Great team culture …more\nWeb Developer & Web Application 1,969 members\n1"}
