{"text": "We are Hiring! Exciting opportunity for software engineers to work with us.\n1. We are expanding rapidly across products and scale with our enterprise customers\n2. FIRST ones, and ONLY ones as of today, to go live with end to end selling\n3. Full control on product and customisations for Enterprises, product build bottoms up in-house Looking for 2 backend software engineers, with ownership and agency - as the first and foremost criteria. Go through the Job description for the rest of the details. Apply if this you. Look forward to interacting with you soon!\n…more\nBackend, Infra and Scaling with AI for most exciting startup from India\nJob by SalesAgents AI\nIndia (Remote)\nView job\nView job\n3"}
{"text": "🚀 We're still ! | at D3V 🎯 🚀 Thrilled to keep building across the stack! From designing responsive UIs to optimizing backend APIs, being a Developer means bridging the gap between ideas and execution. here : https://lnkd.in/gzHPk_XJ 🌟 is looking for a Dynamic & self driven Full Stack Developer join our growing team! …more\nFullStack Developer\nJob by D3V Technology Solutions\nBengaluru, Karnataka, India (Remote)\nView job\nView job\n1\n2 comments"}
{"text": "We are 🔊🔊 🔊🔊 🔊🔊 …more\nIT Job Openings IT Job Openings Subscribe\nSubscribe to {:entityName}\nWe are Hiring for Sr. Java Developer | Ahmedabad | Hybrid\nHuptech HR Solutions\n51\n22 comments\n1 repost"}
{"text": "We’re looking for an 🚀 Engineering Lead 🚀 (SDE-3 / Staff Engineer level) — a rare early opportunity to own tech end-to-end and scale a business at the intersection of mobility, retail and digital commerce. If you’re a senior full-stack builder who thrives in high-ownership roles, loves shipping fast, and wants to see your work directly shape a company’s trajectory — we want to meet you. Apply here 👇 | Vutto | Rohit Khurana | Snehil Tiwari …more\nEngineering Lead\nJob by Vutto\nNew Delhi, Delhi, India (On-site)\nView job\nView job\n40\n6 comments\n5 reposts"}
{"text": "I'm a Java Developer (Springboot). Know anyone who might be interested?\nJava Application Developer (Springboot) Job by Drake International Philippines\nPasay, National Capital Region, Philippines (On-site)\nView job\nView job\n6"}
{"text": "Transform complex Maximo queries into simple conversations - just ask what you need and get instant results. Media player modal window The media could not be loaded, either because the server or network failed or because the format is not supported.\nFrom Complex SQL to Simple Questions: My Maximo Database Helper App\nMohamed Ghareeb\n34\n9 comments\n2 reposts"}
{"text": "ONLY Interested in joining this group?\n🚀 We’re Hiring: Web Developer / Web App Developer Join our team to build modern, scalable, and user-friendly web applications!\n📍 [Remote / Location] | 🕒 [Full-time / Contract] What we’re looking for: Experience with HTML, CSS, JS & frameworks like React/Vue API integration & back-end basics Passion for clean, efficient code 💼 Flexible work | Growth opportunities | Great team culture …more\nWeb Developer & Web Application 1,961 members\n1"}
