{"text": "We are Hiring! Exciting opportunity for software engineers to work with us.\n1. We are expanding rapidly across products and scale with our enterprise customers\n2. FIRST ones, and ONLY ones as of today, to go live with end to end selling\n3. Full control on product and customisations for Enterprises, product build bottoms up in-house Looking for 2 backend software engineers, with ownership and agency - as the first and foremost criteria. Go through the Job description for the rest of the details. Apply if this you. Look forward to interacting with you soon!\n…more\nBackend, Infra and Scaling with AI for most exciting startup from India\nJob by SalesAgents AI\nIndia (Remote)\nView job\nView job\n13\n2 comments"}
{"text": "Optum is hiring off campus drive for Software Engineer.\nExpected CTC: 6 - 10 LPA\nYear of experience: 0 - 2 Years\nSkills: Python, SQL Apply here: https://lnkd.in/dHd2mAz6 Join this WhatsApp job group: https://lnkd.in/dEBr7sKm …more\nAre you looking for job?\nThe author can see how you vote. Learn more\nAre you looking for job?\nYes\nNo\nAlready applied. 16 votes • 1w left\n1 week left 4\n4 comments"}
{"text": "🚨 We’re hiring a Senior Software Engineer! If you're excited about building scalable products, solving complex technical challenges, and working in a fast-paced startup environment — this is your chance to make a real impact from day one. 👉 Apply now or tag someone who’d be a perfect fit for this role! …more\nSenior Software Engineer\nJob by HeyEV!\nPrayagraj, Uttar Pradesh, India (On-site)\nView job\nView job\n7\n1 repost"}
{"text": "🚀 We're still ! | at D3V 🎯 🚀 Thrilled to keep building across the stack! From designing responsive UIs to optimizing backend APIs, being a Developer means bridging the gap between ideas and execution. here : https://lnkd.in/gzHPk_XJ 🌟 is looking for a Dynamic & self driven Full Stack Developer join our growing team! …more\nFullStack Developer\nJob by D3V Technology Solutions\nBengaluru, Karnataka, India (Remote)\nView job\nView job\n1\n2 comments"}
{"text": "Are you based in Greater Toronto area, currently I'm hiring MERN Stack Backend Developer. You will play a critical role in architecting, developing, and maintaining the backend microservices that power our cloud-native, containerized digital health platform. If you thrive in a fast-paced environment and want to work with some of the most innovative health systems in the country, this is for you. https://lnkd.in/gfpxKCmE\n…more\nSenior Backend Developer (MERN Stack) Job by Emids\nToronto, Ontario, Canada (Hybrid)\nView job\nView job\n7"}
{"text": "URGENT !! I am currently searching for Freshers passionate about kickstarting their career as Developer. Job Type: Remote\nSalary: Depends On Interview\nQualification: Any Graduation / Freshers Skills Set:- Frontend Developer: HTML, CSS, JavaScript\nBackend Developer: Node.js, Python, or PHP UI/UX Designer: Figma, Adobe XD, or Sketch Comment to get shortlisted within 24 hours. Dm Me : https://lnkd.in/d624BsUh\n…more\n56\n60 comments"}
{"text": "Check out this job at Genpact: Senior Java Developer\nMultiple Locations - Bengaluru, Pune, Mumbai\nSenior Java Developer Job by Genpact\nMumbai, Maharashtra, India (Hybrid)\nView job\nView job\n6"}
{"text": "Job Title: Java Developer Location : Jersey City, NJ (Local to New jersey or NY )\nRTTO – 5 Days Onsite Skills : Java/ Spring boot / Kubernetes / Database SQL - no SQL.\nRequired Skillet: Java backend developers with multi-threading, spring boot, data structures which is a basic requirement\nKubernetes and cloud experience\nRelational and non-relational DB experience - Oracle/Cassandra/Cockroach DB\nExperience in event based processing like MQ, Kafka\nExperience in distributed caching\nExperience in CI/CD\nExperience in Deployment and Testing strategies\npoonam.gautam@zodiac-solutions.com\n…more\n11\n10 comments"}
{"text": "🔥 30-Days Java Basics Challenge – For Beginners 🔥\n📅 Day 05 🚀 Java Developers — Here's a quick brain teaser: 💡\n📝 Comment below ✍️ why you chose your answer! 💭\n💻 Let’s test your core Java knowledge 🧠💪 🔁 Like 👍 | 💬 Comment | 🔄 Repost | 👥 Follow me for more such polls 📊 …more\nWhat is the extension of a Java file?\nThe author can see how you vote. Learn more\nWhat is the extension of a Java file?\n.jav\n.java\n.class 7 votes • 3d left\n3 days left"}
{"text": "We’re looking for an 🚀 Engineering Lead 🚀 (SDE-3 / Staff Engineer level) — a rare early opportunity to own tech end-to-end and scale a business at the intersection of mobility, retail and digital commerce. If you’re a senior full-stack builder who thrives in high-ownership roles, loves shipping fast, and wants to see your work directly shape a company’s trajectory — we want to meet you. Apply here 👇 | Vutto | Rohit Khurana | Snehil Tiwari …more\nEngineering Lead\nJob by Vutto\nNew Delhi, Delhi, India (On-site)\nView job\nView job\n43\n7 comments\n5 reposts"}
{"text": "I'm : Sr Principal Architect/ SDE 🚨 Are you a Principal SDE ready to architect the future of digital health? 🚨\nWe’re building a state-of-the-art system for our digital portfolio—and I’m looking for a technical architect who thrives on designing scalable, world-class architectures. 🎯 You’re a fit if:\nYou’re a hands-on architect with deep database expertise\nYou love solving hard problems that matter\nYou’re ready to lead from the front This role reports directly to me. If you're that person, let’s connect. https://lnkd.in/gdHRDpVY\n…more\nDatabase Architect Job by Abbott\nLivermore, California, United States\nView job\nView job\n7"}
{"text": "We're a new SDE 2 in Bengaluru, Karnataka. Apply today or share this post with your network.\nSDE 2\nJob by Prosperr.io\nBengaluru, Karnataka, India (On-site)\nView job\nView job\n4"}
{"text": ": Java Architect – Core Backend (Spring Boot) 🚀 📍 Location: Plano, TX (12 months contract) ✅ Final Round: Face-to-Face Interview (Local or TX-based candidates only)\nWe’re looking for an experienced Senior Java Spring Boot Developer/Architect to design and build next-generation microservices-based solutions. If you excel in Java, Spring Boot, DDD, REST APIs, CI/CD, Docker/Kubernetes and thrive in solving complex technical challenges—this is for you!\n📧 Share your resume at: sachin.tyagi@kosmixit.com …more\n2\n1 comment"}
{"text": "Immediate opportunity for Senior Java Developer– 4+ years in experience in Java, Springboot/Grails/Play using Java 7/8/Groovy.Extensive experience in creating usable, modular and robust ReSTful API layer..Hands on experience in designing and developing applications using Springboot/Grails/Play using Java 7/8/Groovy.Exposure to performance metrics & visualization techniques and tools .Experience working on full product life cycle development, including design, programming, testing, documentation, implementation and maintenance.Strong verbal/written communication & data presentation skills.Must possess analytical skills and be detailed oriented.Strong multi-tasking skills..Education : BE/ B.Tech/ ME/ M.Tech (Computer Science Background only).. Job Location: Trivandrum / Bangalore (Work From Office only). ,, Please mail : nagesh@global-tech.co.in or call 9980021291.\n…more"}
{"text": "Transform complex Maximo queries into simple conversations - just ask what you need and get instant results. Media player modal window The media could not be loaded, either because the server or network failed or because the format is not supported.\nFrom Complex SQL to Simple Questions: My Maximo Database Helper App\nMohamed Ghareeb\n39\n11 comments\n2 reposts"}
{"text": "Hiring (Immediate Joiners Needed!) We're urgently looking for people who can start immediately at an American company. Apply for Referral:- +91 8209701121 Last Date:- 28/08/2025 We welcome both and . Open positions- Full Stack Developer - , Developer, Developer, Designer, , Social Media Manager, Business Development Associate & : 0-3 years hours: Flexible : 16,000- 45,000 / Monthly in hand : Remote Work schedule: 5 days a week Training will be provided for . Note: Please respond only to personal replies, not anonymous messages. Comment \" \" to get shortlisted within 24 hours.\n…more\nActivate to view larger image,\nActivate to view larger image,"}
{"text": "Urgent – QA Manual Tester (REMOTE) We at 100OK Solutions are looking for a skilled QA Manual Tester to join our team! If you have 0 to 4 years of experience and a passion for ensuring software quality, we want to hear from you! 🔹 Position: QA Manual Tester 🔹 Experience: 0 to 4 years 🔹 Notice Period: Immediate joiners or max 2 weeks 🔹 Work Mode: Remote Join a dynamic team and work on exciting projects! If you're interested or know someone who would be a great fit, send your resume to truptim@istronix.com / https://lnkd.in/e3MyZRVS\n…more\n60\n61 comments\n2 reposts"}
{"text": "ONLY Interested in joining this group?\n🚀 We’re Hiring: Web Developer / Web App Developer Join our team to build modern, scalable, and user-friendly web applications!\n📍 [Remote / Location] | 🕒 [Full-time / Contract] What we’re looking for: Experience with HTML, CSS, JS & frameworks like React/Vue API integration & back-end basics Passion for clean, efficient code 💼 Flexible work | Growth opportunities | Great team culture …more\nWeb Developer & Web Application 1,966 members"}
{"text": "Hello We are Hiring for .js Developer Job Role:- React.js Developer\nLocation:- Baner (work from office)\nExperience:- 3+yr Preferred candidate from Pune location & Immediate Joiner If you are interested then send your resume on hr@amonex.in\n…more\nSoftware Engineer\nJob by Amonex Technologies Private Limited\nPune, Maharashtra, India (On-site)\nView job\nView job\n12\n1 comment"}
{"text": "Hiring: AI Flutter Developer Work Mode: Remote Experience Required: 1 - 5 Years\nSalary: 3 - 8 LPA Skills Required: Flutter, WebRTC, CallKit, VoIP, Node.js, Python, OpenAI API, Whisper, Speech-to-Text, WebSockets, Firebase, Real-time Communication, AI Integration, Backend Development, Data Privacy Apply Here:\nhttps://lnkd.in/g67imsqV ⚠️ Note: The job shown in the preview is not the same as the one described above. To apply for this job, please use the link in the post.\n…more\nFlutter Developer\nJob by MoneyMul\nNoida, Uttar Pradesh, India (On-site)\nView job\nView job"}
{"text": "We are hiring multiple Backend compiler engineers in California. We are looking for compiler engineers with LLVM backend experience to work on a LLVM backend targeting future Nvidia GPUs.\nSenior Backend Compiler Engineer\nJob by NVIDIA\nSanta Clara, CA\nView the open to hiring details of Jerry (Jing Ru)\nView job\n25\n2 comments\n6 reposts"}
{"text": "📡 Saturday Forecast:\n☔ HCMC – rain all day\n🌞 Skylink Group – bright with opportunities! 👩‍💻 Junior Backend Engineer (Python)\n📍 Thu Duc City – HCMC\n💰 Up to $1500 ++ Gross 👉 Join us on the BI Tool project to sharpen your Python backend skills & grow with a talented team. 📩 Apply now: tuyendung@skylink.vn …more\nSoftware Engineer\nJob by Skylink Group\nThủ Đức, Ho Chi Minh City, Vietnam (On-site)\nView job\nView job"}
