[
    {
        "title": "Java Engineer",
        "company": "Virtusa",
        "location": "Bangalore Urban, Karnataka, India",
        "date_posted": "",
        "description": "About the job\n\nDeliver performance focused backend system solutions mostly in Java. Build and maintain new and existing applications using Java Object-Oriented software analysis and design\n\nSolid understanding of object oriented programming and data modelling\n\nExperience with networking, and distributed system\n\nExperience with and appreciation for automated testing\n\nExperience with cloud compute, virtualisation and automation, using Kubernetes and AWS\n\nPreferable if you have exposure with open-source applications, e.g. Cassandra and Apache Flink\n\nB.S./MS/PhD in Computer Science or related field or equivalent experience\n\nProven experience solving problems in complex domains\n\nProactively identify and manage risks, including assessing and controlling risks of various kinds and apply this appropriately to diverse situations\n\nDisplays courage and willing to always contribute constructive feedback not being afraid to highlight issues and challenges and bringing alternative solutions to the table\n\n\n\nDesired Skills and Experience\n\nSpring Boot",
        "job_url": "https://www.linkedin.com/jobs/view/4248402614/?eBP=CwEAAAGYswO8UJvEh5YFPjtarpuTtcxShcylercauavfILDETWnFOobjz_02f4395ALKMSBBzFPmDd1us28D5BHokD4J0py6oDmA4ItOPsvvnGkwFXnnOGKz6UqPQ9S-UIlMVfn8NHb9Lg9jGHIfeqbRJOgqWfP2Qdh1z4w4E4Z0rCRIff9TqXJc6kKtI8Lc3V8-CUtK9C7grrZg1befeWsNYbkZ8CQs41hZ6FBtDDVZfVh6hntYSoxUznbn1ypNVuqn-Ym6Vsow_mdUcp5JyQcVzrIFuRHaYHGzeO1ics4Uh4exBfSs4SYAPtUwiZCQ8eaLau1NzR0ts2CMeQ6gMle2XWwu4y_uvk04ByMMmVKcPLcr9FWwkVGHavE4EACMiSWm7T_qqn-OJyRo17bkKBkfFLU_6XcUqMxOM-VK8vewMuSGmQZ7ldzJRabR90AyO1DQCI0uxeLt7s4eIYBwLLJgF86kg9LPTCD7eSTBPezP61c&refId=Zl9Ahn2bt0vXUAkMWmyrFw%3D%3D&trackingId=UbrfEu5p7NwEPB2sAPJrTg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Intermediate Applications Developer - Java Spring boot",
        "company": "UPS",
        "location": "Chennai, Tamil Nadu, India",
        "date_posted": "",
        "description": "About the job\n\nBefore you apply to a job, select your language preference from the options available at the top right of this page.\n\nExplore your next opportunity at a Fortune Global 500 organization. Envision innovative possibilities, experience our rewarding culture, and work with talented teams that help you become better every day. We know what it takes to lead UPS into tomorrow—people with a unique combination of skill + passion. If you have the qualities and drive to lead yourself or teams, there are roles ready to cultivate your skills and take you to the next level.\n\nJob Description\n\nJob Summary\n\nThis position provides input, support, and performs full systems life cycle management activities (e.g., analyses, technical requirements, design, coding, testing, implementation of systems and applications software, etc.). He/She participates in component and data architecture design, technology planning, and testing for Applications Development (AD) initiatives to meet business requirements. This position provides input to applications development project plans and integrations. He/She collaborates with teams and supports emerging technologies to ensure effective communication and achievement of objectives. This position provides knowledge and support for applications development, integration, and maintenance. He/She provides input to department and project teams on decisions supporting projects.\n\nResponsibilities\n\n\nPerforms systems analysis and design.\nDesigns and develops moderate to highly complex applications.\nDevelops application documentation.\nProduces integration builds.\nPerforms maintenance and support.\nSupports emerging technologies and products.\n\n\nTechnology\n\nJava, Spring Boot, Microservices/REST API,, Message Broker (AMQ, WMQ), JDBC, CI/CD Pipeline,Cloud Technologies, Application Security, Database, Linux and some shell scripting,\n\nQualifications\n\n\nBachelor’s Degree or International equivalent\nBachelor's Degree or International equivalent in Computer Science, Information Systems, Mathematics, Statistics, or related field - Preferred\n\n\nEmployee Type\n\nPermanent\n\nUPS is committed to providing a workplace free of discrimination, harassment, and retaliation.",
        "job_url": "https://www.linkedin.com/jobs/view/4242243637/?eBP=BUDGET_EXHAUSTED_JOB&refId=Zl9Ahn2bt0vXUAkMWmyrFw%3D%3D&trackingId=dgwEglv369nUJNTlm6o7oQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java FullStack",
        "company": "Zensar Technologies",
        "location": "Hyderabad, Telangana, India",
        "date_posted": "1 day ago",
        "description": "About the job\n\nJob Description\n\nWhat's this role about?\n\nHere's How You'll Contribute\n\nYou'll do this by:\n\nCore Skills\n\nDesired Skills:\n\nHow We’d Like You To Lead\n\nAdvantage Zensar\n\nWe are a technology consulting and services company with 11, 800+ associates in 33 global locations. More than 130 leading enterprises depend on our expertise to be more disruptive, agile and competitive. We focus on conceptualizing, designing, engineering, marketing, and managing digital products and experiences for high-growth companies looking to disrupt through innovation and velocity.\n\nZensar Technologies is an Equal Employment Opportunity (EEO) and Affirmative Action Employer, encouraging diversity in the workplace. Please be assured that we will consider all qualified applicants fairly, regardless of race, creed, color, ancestry, religion, sex, national origin, citizen status, age, sexual orientation, gender identity, disability, marital status, family medical leave status, or protected veterans’ status.\n\nZensar Is a Place Where You Are Free To Express Yourself In An Environment That Values Individuality, Nurtures Development And Is Mindful Of Wellbeing. We Put Our People And Customers At The Center Of Everything That We Do. Our Core Values Include\n\n\nPutting people first\nClient-centricity\nCollaboration\n\n\nGrow. Own. Achieve. Learn. with Zensar",
        "job_url": "https://www.linkedin.com/jobs/view/4286478897/?eBP=BUDGET_EXHAUSTED_JOB&refId=Zl9Ahn2bt0vXUAkMWmyrFw%3D%3D&trackingId=lRr1fz1F1vHs3ljVonKxpA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Senior Java Developer/Consultant",
        "company": "AAPMOR Inc.",
        "location": "Hyderabad, Telangana, India",
        "date_posted": "11 hours ago",
        "description": "About the job\n\nJob Description\n\nWe are looking for a highly skilled Senior Java Full Stack Developer with a strong technical background and leadership potential. The ideal candidate should have extensive experience in backend and frontend development, cloud technologies, and architectural design. This role is ideal for professionals aspiring to transition into a Technical Lead position.\n\nKey Responsibilities\n\n\nTechnical Leadership: Provide guidance and mentorship to the development team, ensuring best practices in coding, architecture, and software design.\nFull Stack Development: Design, develop, and maintain scalable applications using Java, Spring Boot, Angular/React, and microservices architecture.\nCloud & DevOps: Deploy and manage applications in cloud environments (AWS/Azure/GCP) using CI/CD pipelines and containerization (Docker, Kubernetes).\nCode Quality & Performance: Write clean, maintainable, and efficient code while optimizing performance and security.\nCollaboration: Work closely with cross-functional teams, including UI/UX designers, product managers, and DevOps engineers, to deliver high-quality software solutions.\nAgile Methodologies: Participate in sprint planning, code reviews, and retrospectives, ensuring smooth project execution.\nProblem-Solving: Troubleshoot complex issues and propose effective solutions while staying updated with emerging technologies.\n\n\nRequired Skills\n\n\nBackend: Java 8+, Spring Boot, Microservices, Hibernate, RESTful APIs\nFrontend: Angular/React, JavaScript, TypeScript, HTML, CSS\nDatabase: MySQL, PostgreSQL, MongoDB\nCloud & DevOps: AWS/Azure/GCP, Docker, Kubernetes, Jenkins, CI/CD pipelines\nArchitecture & Security: Experience with scalable system design, authentication, and security best practices\nVersion Control: Git, GitHub/GitLab\nSoft Skills: Strong analytical and problem-solving skills, leadership qualities, and excellent communication skills\n\n\nPreferred Qualifications\n\n\nExperience leading teams or mentoring junior developers\nExposure to AI/ML integration in Java applications (nice to have)\nCertifications in Java, Cloud (AWS/Azure), or Agile methodologies",
        "job_url": "https://www.linkedin.com/jobs/view/4283680944/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=Zl9Ahn2bt0vXUAkMWmyrFw%3D%3D&trackingId=%2FOahiyKKJmDrIkQ7cmvUnw%3D%3D&trk=flagship3_search_srp_jobs"
    }
]