[
    {
        "title": null,
        "company": null,
        "location": null,
        "date_posted": "1 day ago",
        "description": null,
        "job_url": "https://www.linkedin.com/jobs/view/4286573707/?trk=flagship3_search_srp_jobs"
    },
    {
        "title": null,
        "company": null,
        "location": null,
        "date_posted": "1 day ago",
        "description": null,
        "job_url": "https://www.linkedin.com/jobs/view/4287275323/?trk=flagship3_search_srp_jobs"
    },
    {
        "title": null,
        "company": null,
        "location": null,
        "date_posted": "1 day ago",
        "description": null,
        "job_url": "https://www.linkedin.com/jobs/view/4286464140/?trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Lead Java Developer",
        "company": null,
        "location": null,
        "date_posted": "1 day ago",
        "description": "About the job",
        "job_url": "https://www.linkedin.com/jobs/view/4286848531/?trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Lead Java Developer",
        "company": null,
        "location": null,
        "date_posted": "1 day ago",
        "description": "About the job",
        "job_url": "https://www.linkedin.com/jobs/view/4286656599/?trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Lead Java Developer",
        "company": null,
        "location": null,
        "date_posted": "1 day ago",
        "description": "About the job",
        "job_url": "https://www.linkedin.com/jobs/view/4283044014/?trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Software Engineer 2",
        "company": "Boomi",
        "location": "Bengaluru South, Karnataka, India",
        "date_posted": "",
        "description": "About the job\n\nAbout Boomi And What Makes Us Special\n\nAre you ready to work at a fast-growing company where you can make a difference? Boomi aims to make the world a better place by connecting everyone to everything, anywhere. Our award-winning, intelligent integration and automation platform helps organizations power the future of business. At Boomi, you’ll work with world-class people and industry-leading technology. We hire trailblazers with an entrepreneurial spirit who can solve challenging problems, make a real impact, and want to be part of building something big. If this sounds like a good fit for you, check out boomi.com or visit our Boomi Careers page to learn more.\n\nSoftware Engineer 2\n\nAbout Boomi And What Makes Us Special\n\nAre you ready to work on world-changing technologies? Today, organizations need to move with increased agility and insight to grow and thrive. Boomi is one of the hottest tech companies in the SaaS/Cloud industry, named a leader for eight years in a row in the Gartner Enterprise iPaaS Magic Quadrant, and recently recognized by Inc. Magazine as one of the best workplaces. Our award-winning, patented technology is transforming the world of integration by making enterprise-class integration technology accessible and affordable to companies of all sizes.\n\nBoomi provides the foundation on which businesses can evolve and innovate. We help organizations connect everything and engage everywhere across any channel, device, or platform. More than 18,000 organizations are using Boomi to run better, faster, and smarter.\n\nWorking at Boomi means doing what you love. We hire trailblazers with an entrepreneurial spirit who can solve challenging problems, make a real impact in technology, and want to build something big. If you are passionate about solving hard problems, enjoy working with world-class people, and developing cutting-edge technology, we want to talk to you.\n\nSoftware Engineer 2\n\nWe are seeking a passionate, self-motivated Software Engineer with proven hands-on experience on designing and implementing complex enterprise applications using a wide range of technology stack including Core Java, Advanced Java and excellent debugging skills. You will be joining a top-notch, highly motivated team of developers who thrive on collaboration, open communication and making an impact.\n\nJoin us as a Java Backend Developer on our Software Engineering team in India to do the best work of your career and make a profound impact on our Customer.\n\nWhat You’ll Achieve\n\nAs a Software Engineer, you will be responsible for Building various Connectors that incorporate Scalable design and programming Best Practices. As a Software Engineer, you will be responsible for making sure the developed Connector meets Business Goals and quality expectations. You will work with product management, other engineering teams, customer success and support on testing new product features and enhancements across various areas of Boomi offerings.\n\nYou will:\n\n\nDesign & implement tactical enhancements in Boomi Connectors \nContinuously enable oneself on new feature enhancements \nWork closely with cross-functional teams QA to deliver high-quality deliverables \nPerform code, design, and unit test reviews \nInvestigate defects to identify the root cause and provide potential solution \nWrite JUnit Tests \n\n\nRequired Skills: \n\n\n2 - 4 years hands on experience on Java, Backend development and JUnit \nTroubleshooting - good Debugging skills \nGood understanding of Programming Principles and Practices \nMust be a quick learner and should keep pace with technologies \nGood Communication Skills (Oral & Written) \n\n\nDesired Skills:\n\n\nExperience in OOAD, Design Pattern, SOLID Principles \nExperience in debugging complex defects \nExperience building Java applications \nExperience with JUnit Test \nExposure to Integration Platform for example Mulesoft, Oracle Integration \nExposure to multiple Databases for example, Oracle, MySQL, MS SQL Server \n\n\nEducation: \n\nBachelor/Masters in any Branch of Engineering or equivalent technical field\n\nAt Boomi we show up for each other with empathy, compassion, and purpose because, at Boomi, we win as one––that’s why we strive to integrate more diverse voices for a stronger and smarter team.\n\nBoomi is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Boomi are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Boomi will not tolerate discrimination or harassment based on any of these characteristics. Boomi encourages applicants of all ages.\n\nBoomi is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind.\n\nBe Bold. Be You. Be Boomi. We take pride in our culture and core values and are committed to being a place where everyone can be their true, authentic self. Our team members are our most valuable resources, and we look for and encourage diversity in backgrounds, thoughts, life experiences, knowledge, and capabilities.\n\nAll employment decisions are based on business needs, job requirements, and individual qualifications.\n\nBoomi strives to create an inclusive and accessible environment for candidates and employees. If you need accommodation during the application or interview process, please submit a request to talent@boomi.com. This inbox is strictly for accommodations, please do not send resumes or general inquiries.",
        "job_url": "https://www.linkedin.com/jobs/view/4259501741/?eBP=CwEAAAGYseD-FoKG5s9ZnqMrTOiS9N_83q1y38t1pYSTECOIr-MHNPyBWqF-gfhJ3RLUrShVA-pcYQhvw4ZZ0X9BToJ7YaQlu3L8DO_qmeAduW_WMfxAqO6YkV-2Unkpgcxi3BjkFYCA4ZA04A5i5NMGqr06LLflCDRTP6lP7jAt4HovF3m-bpKNKs1jYPkO1VrQR0n8cOzFNkl7XfCq9PGB_seXb0zxz4CBxKRv0JjT4Bjk_G4fx0z1EG7rR-4lLP9Y2JaFlxLfB8nNWUA8PGjNmJN47BKOfQxTtm-JUwvjjdd8PX1wY7Egj7RtN5in4DUnR7JYIxtP61y_MHdw0XmyOa1hhuu2ekB6kb3ipYgcfzvannqSn10ajYFTCzvQwEWVajVkmmmFZ3CRifzDLShv-JAHKVAgTwhZ5t2xBGxY13E6k8fLNNooVFc8Z_4cEj_jczXMJYGzukrQDOKgJsZ6V8EizxZlbcko9S4tj9KJZpK09qFQ8YobnEdw3YY5l5XTuePxUMb1d-PY_9ym12U&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=O%2FIylFrTJJ2Es5NT4fhNJw%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Software Engineer – Networking (L2/L3, SONiC)",
        "company": "Jobstronaut",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "52 minutes ago",
        "description": "About the job\n\nThe client is looking at hiring a Software Engineer – Networking (L2/L3, SONiC) for their team at Bangalore.\n\n\n\n\nClient is seeking a skilled Software Engineer with strong expertise in Layer 2 and Layer 3 networking protocols and hands-on experience with SONiC (Software for Open Networking in the Cloud). The ideal candidate will contribute to the design, development, testing, and deployment of advanced networking solutions for high-performance and scalable environments.\n\n\n\n\nKey Responsibilities:\n\n\n\n\nDesign, develop, and maintain networking features and modules with a focus on L2/L3 networking protocols (e.g., VLAN, STP, OSPF, BGP, MPLS).\nDevelop and integrate features on SONiC (Software for Open Networking in the Cloud) platforms.\nWork on switch/router operating system internals, hardware abstraction, and control plane development.\nDebug, troubleshoot, and optimize performance issues across networking stacks.\nCollaborate with cross-functional teams including QA, hardware, and system engineering to deliver reliable solutions.\nParticipate in code reviews, contribute to best practices, and support continuous integration/deployment processes.\n\n\n\n\nRequired Skills & Experience:\n\n\n\n\nBachelor’s or Master’s degree in Computer Science, Electronics, or related field.\nProven experience in networking software development with emphasis on L2/L3 protocols.\nHands-on experience with SONiC (SwitchDev, SAI, or related frameworks).\nStrong programming skills in C/C++ and/or Python.\nExperience working with Linux networking stack, kernel programming, or device drivers.\nFamiliarity with switch architectures (Broadcom, Mellanox, or similar).\nStrong debugging, problem-solving, and analytical skills.\n\n\n\n\nGood to Have:\n\n\n\n\nExperience with large-scale data center networking.\nContributions to open-source networking projects (especially SONiC).\nKnowledge of containerization (Docker), virtualization, or orchestration platforms (Kubernetes).\nExposure to network automation frameworks (Ansible, Terraform).",
        "job_url": "https://www.linkedin.com/jobs/view/4286852063/?eBP=CwEAAAGYseD-Fj9RK2CqupJU69r62dwwozv8wUZNH3ZYbCG3wcgLCbauqKrN5BDafcYNqhlxjgHuBFIqQzhnkR3YU0A03IG-4qYxhxK158STNgKv4EMk8V8CWhhV9lEGSuSpe13ezRgaR03by03zJLtBiry1rLUtZiInXw5MAg9SmCHppA2gM6Sn7ep79CI9KrEmFEgUfZi07qfPQWx18-AUPJezjkVaxs8kddf_JzsNUawxqko65yA77_zZZiQL-fbR5LRf8SL9TvLxNCZVVC2L0qrhO7h5uL3HyTG8Co438YM1ebYBC3Ze543ag4yZPkGCRbRA_epRT5zhLzO2tMr9q6huBtHScriWPIPLC9bGc8HGP3uJa8pX-35DmHP4oYswzRURBZUMBuk6rSQ4mi4FsX6_0zlKsIfL8tiKkfg6Gk52q-R3dhf0yySjIyZXrujl7qhucss1J8mBIbjwDW-oOGoyVK0RWjJ8s972EBfvNHA&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=lNC8ZyULYSvuuD%2BCZTFMJQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Software Engineer",
        "company": "DHL",
        "location": "Indore, Madhya Pradesh, India",
        "date_posted": "",
        "description": "About the job\n\nYour IT Future, Delivered.\n\nSoftware Engineer\n\nWith a global team of 5600+ IT professionals, DHL IT Services connects people and keeps the global economy running by continuously innovating and creating sustainable digital solutions. We work beyond global borders and push boundaries across all dimensions of logistics. You can leave your mark shaping the technology backbone of the biggest logistics company of the world. Our locations, Malaysia, Czech Republic and India earned the #GreatPlaceToWork certification, reflecting our commitment to exceptional employee experience.\n\nDigitalization. Simply delivered.\n\nAt IT Services, we are committed to driving digital transformation by bringing onboard technical experts proficient in IBM WTX, ITX 10, and WMQ.\n\nWe seek professionals with strong expertise in SQL and UNIX shell scripting, along with a deep understanding of EDI industry standards and diverse data formats, including ANSI X12, EDIFACT, ROSETTANET, TRADACOMS, XML, IDocs, and proprietary formats (Fixed Length, Delimited).\n\nA strong grasp of modern communication protocols such as HTTP, HTTPS, SFTP, FTPS, AS2, and plain FTP is essential to ensure seamless data exchange in a digital-first ecosystem.\n\nExperience with Azure is highly valued as we continue to enhance cloud-based solutions for agility and scalability.\n\nOur DHL LINK team is continuously expanding. No matter your level of Software Engineer proficiency, you can always grow within our diverse environment.\n\n#DHL #DHLITServices #GreatPlace ##DIGITALBYDEFAULT\n\nGrow together.\n\n\n\nInteract with business stakeholders and other technical team members to gather and analyze business application requirements.\nDesign integration solutions to satisfy application (business and technical) requirements.\nImplement integration solutions using WebSphere Message Broker, ITX and WMQ.\nProvide assistance to the test teams and support teams as appropriate.\nProvide written status reports with regard to project status, task, and issues/risks.\n\n\n\n Ready to embark on the journey? Here’s what we are looking for:\n\nAs a Software Engineer, you are expecting to leverage your expertise in a dynamic and collaborative environment with the below skillset.\n\n\n\nTechnical Expertise: Proficiency in IBM WTX, ITX 10, and WMQ.\nProgramming Skills: Strong knowledge of SQL and UNIX shell scripting.\nEDI & Data Formats: Familiarity with EDI industry standards and various data formats, including ANSI X12, EDIFACT, ROSETTANET, TRADACOMS, XML, IDocs, and proprietary formats (Fixed Length, Delimited).\nCommunication Protocols: Solid understanding of HTTP, HTTPS, SFTP, FTPS, AS2, and plain FTP.\nCloud Knowledge: Experience with Azure is highly valued.\n\n\n\nYou are a technology aficionado, therefore you have a good understanding of Strong analytical and problem-solving abilities, excellent communication and teamwork skills. You are able to work independently, prioritize and organize your tasks under time and workload pressure. Working in a multinational environment, you can expect cross-region collaboration with teams around the globe, thus being advanced in spoken and written English will be certainly useful.\n\nAn array of benefits for you:\n\n\n\nHybrid work arrangements to balance in-office collaboration and home flexibility.\nAnnual Leave: 42 days off apart from Public / National Holidays.\nMedical Insurance: Self + Spouse + 2 children. An option to opt for Voluntary Parental Insurance (Parents / Parent -in-laws) at a nominal premium covering pre existing disease.\nIn House training programs: professional and technical training certifications.",
        "job_url": "https://www.linkedin.com/jobs/view/4273038599/?eBP=CwEAAAGYseD-FuFB4i0wLUjG_ON5d1p7SU0an8S-jfRXF-_lIgF-Zf7A6XDng5wjrtApYqMx86wUpUkv162fakSn4EqP60SrqfXDBZb6qPY0LuFsDEYCMMdkNn5EgyqUinFgoTd_o2GpzY2nhdinHNseHtSnOlxWxAV1g8h-j-sJVN_bSIrFtxgDavgAYkWaNI-8pz1l0tkSBGL5kb4gLh2iv7CHAyCf8CPVbRW3jxqPV1dhDqSeffqeedw-5WnlHKqlWx5cW6bNkXCi7XlBleFMp5SYCEZ8F4QMtIVbAOZwD-f3SzYt6Lfp1mPxroeIrJlwf9vUDopAdOH6o8nZkSYlEYDV4m3OUq055QW1Sz582c8GTlYHY6jTShxtYJdOIKrKf9m6RBfpWj3KVSdgZQv4q37JJURGNjSq-w2VYG-g7i7cfTH02wfh&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=hVgPVVf60lVDL5S1vwFpqQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Lead - Software Engineering",
        "company": "Fidelity Investments",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "",
        "description": "About the job\n\nJob Description\n\nJob Title - Lead - Software Engineering\n\nLeverage emerging technologies and provide solutions to enable Customer Satisfaction, drive Scale & Efficiency and Business Results.\n\nThe Purpose of This Role\n\nData Engineering & Exchange group within Workplace Solutions Business Unit is focused on building and maintaining the Enterprise Data environments like Operational Data Store, Warehouse and Data Lake which are essential for business reporting and analytics capability. Our technology teams interact regularly with Business Analysts, Architects, Data Modelers, Scrum Master and other engineers from various teams across the globe to deliver the solutions which will delight our customers.\n\nThe Value You Deliver\n\nAs a Lead Software engineer, you will be responsible for\n\n\nAbility to quickly learn and Analyze complex Systems \nSupport the Platform \nVery Good Analytical Skills \nAbility to work independently \nExcellent technical and debugging skills \nAbility to create and maintain documentation wherever necessary \nShould be innovative and works as collaborator with Scrum team \nAnalysis design, development, unit testing and execution with coding standards \nShould be able to manage projects individually with agile methodology \n\n\nThe Skills That Are Key To This Role\n\nTechnical / Behavioral\n\n\nOracle SQL and PL/SQL knowledge a must\nExperience in supporting the system, debugging issues and fixing the issues Database related components (good to have) \nKnowledge in Cloud (Azure) \nKnowledge of Performance analysis and tuning \nCI/CD tools such as Shell scripting, Maven, Git / Stash, Jenkins, Artifactory, uDeploy etc. \nBehavioral\nYou should be able to effectively communicate on emails and/or orally with team members and stakeholders\nYou should be able to quickly learn and adapt to new technologies\n\nThe Skills that are Good To Have for this role\n\n\nUnderstanding of Agile methodology and working in scrum teams\nExperience on using tools like JIRA, Jenkins\n\n\nHow Your Work Impacts The Organization\n\nWS (Workplace Solutions) helps our customers save and invest through workplace retirement savings plans, build lifetime relationships with customers and provide employers with cost-effective, integrated employee benefit solutions. WS serves customers online, over the phone, and through a nationwide network of investor centers. WS is also committed to helping drive employee retirement readiness by delivering leading-edge financial solutions to employers, including recordkeeping, cash management products and services and personal advisory services (PAS).\n\nThe Expertise We’re Looking For\n\n\nBachelor degree in Computer science or any other discipline\nOracle PLSQL, Cloud technologies (Azure/AWS)\n\n\nLocation: Bangalore\n\nShift timings: 11:00 am - 8:00pm\n\nCertifications\n\nCategory:\n\nInformation Technology",
        "job_url": "https://www.linkedin.com/jobs/view/4247511655/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=NzoPu5x60uaPrnBU6QgPXQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer",
        "company": "Virtusa",
        "location": "Chennai, Tamil Nadu, India",
        "date_posted": "",
        "description": "About the job\n\nP2-C1-TSTS\n\nDevelopment\n\nDesign, develop, and maintain Java-based microservices.\n\nWrite clean, efficient, and well-documented code.\n\nCollaborate with other developers and stakeholders to define requirements and solutions.\n\nParticipate in code reviews and contribute to team knowledge sharing.\n\nMicroservices Architecture\n\nUnderstand and apply microservices principles and best practices.\n\nDesign and implement RESTful APIs.\n\nExperience with containerization technologies (e.g., Docker) and orchestration (e.g., Kubernetes).\n\nKnowledge of distributed systems and service discovery.\n\nExperience with design patterns (e.g., circuit breaker pattern, proxy pattern).\n\nDeep understanding of distributed systems and service discovery.\n\nTesting & Quality\n\nDevelop and execute unit, integration, and performance tests.\n\nEnsure code quality and adhere to coding standards.\n\nDebug and resolve issues promptly.\n\nDeployment & Monitoring\n\nParticipate in the CI/CD pipeline.\n\nDeploy microservices to cloud platforms (e.g., AWS, Azure, GCP).\n\nMonitor application performance and identify areas for improvement.\n\nProgramming Languages\n\nProficiency in Java (J2EE, Spring Boot).\n\nFamiliarity with other relevant languages (e.g., JavaScript, Python).\n\nMicroservices\n\nExperience designing and developing microservices.\n\nKnowledge of RESTful APIs and other communication patterns.\n\nExperience with Spring Framework.\n\nExperience with containerization (Docker) and orchestration (Kubernetes).\n\nDatabases\n\nExperience with SQL databases (e.g., MySQL, PostgreSQL) and NoSQL databases (e.g., MongoDB).\n\nFamiliarity with ORM frameworks (e.g., JPA, Hibernate).\n\nCloud Platforms\n\nExperience with at least one cloud platform (e.g., AWS, Azure, GCP).\n\nTools & Technologies\n\nFamiliarity with CI/CD tools (e.g., Jenkins, Git).\n\nKnowledge of logging and monitoring tools (e.g., Splunk, Dynatrace).\n\nExperience with messaging brokers (e.g., Kafka, ActiveMQ).\n\nOther\n\nStrong problem-solving and analytical skills.\n\nExcellent communication and collaboration skills.\n\nExperience working in Agile/Scrum environments.\n\nDevOps\n\nExperience with DevOps practices and automation.",
        "job_url": "https://www.linkedin.com/jobs/view/4201271820/?eBP=CwEAAAGYseD-FnMcXKO8CsyXeVaNCJeOCwymG6RbRR3p5OG8ofkFwMkfKeYCNfUjCHy1rXOZduktAG-IGPwkf_kqguxRY8wxXPIG0W5IpzCTeHKB1ZbHldhp6XklaZ82YFSexZ7vOA_DtVnH8DisWhEFgc9cUzGkaWPMWTMNjTKQStT6xOb7AV3mNBMKzU5D_Gm_0CNfYHelCaIuuDXnq1yN8ZaKdschi-5tKNaP0ouYViKyv_YB2Sha0YPy5-rTcQbGPNCBM5BSOqgfwyGI_R06DU4KC8vcPNs2My1DhdeHHRAPbcvjp0aoJSnNEQc2ret9hbWpJpfZhtiDoQCphdfExgbHk2wAe-iwbUo2J0gfypb4rLS4rebOorjYQmXE6H1MEjy3GivvgZ_DX8l4MlcFlpsAz0JafOfvd7A3vOHNYPQmQhFafkx0KGqh9vWCeq2MYAJb0o8SU-IlI4xYHuxHbEoD7VuLOUzXD37WCqZ_Q1E4YUTaCPKcXbq8PDX6n2-ZTfoeUU2PLxD_nP4rq0P5AChW&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=9PSUNlVYdwfRSTf%2F3R5FiA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Software Engineer",
        "company": "Light & Wonder",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "",
        "description": "About the job\n\nSciPlay is a leading developer and publisher of digital games on mobile and web platforms, providing highly entertaining free-to-play games that millions of people play every day for their authenticity, engagement and fun.\n\nSciPlay currently offers nine core games, including social casino games Jackpot Party Casino, Gold Fish Casino Slots, Hot Shot Casino and Quick Hit Slots, and casual games MONOPOLY Slots, Bingo Showdown, 88 Fortunes Slots, Backgammon Live and Solitaire Pet Adventure with offices all over the world!\n\nPosition Summary\n\nKey Responsibilities:\n\n\nUnderstand the requirement and develop games for mobile devices (Android & iOS platform).\nWrite high performance, scalable and generic code using OOPS concepts.\nDebugging and bug fixing in developed software.\nParticipate in the design discussion and come up with optimized approach to develop the games.\nDo necessary documentation and share key learnings across with the team.\n\n\n\nRequirements:\n\n\nMinimum of 2 years of software development experience. \nProficient in any of the object-oriented programming language like C++, C#, Java etc.\nStrong understanding on OOPS concept. \nGood knowledge of Data Structures and Algorithms.\nGood analytical, debugging, and problem-solving skills. \nGood written and verbal communication skills. \nPrevious gaming experience and familiarity with Unity engine is a plus. \nAbility to work independently and complete project with minimal supervision.",
        "job_url": "https://www.linkedin.com/jobs/view/4275193961/?eBP=BUDGET_EXHAUSTED_JOB&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=dkgcu3AXjFF%2BeoykW8Ul5g%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Fullstack Developer",
        "company": "Acme Services",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "22 hours ago",
        "description": "About the job\n\nWe seek a seasoned Java Full Stack Developer to design and implement scalable, robust applications across all layers—APIs, logic, persistence, and performance. Responsibilities include mentoring team members, driving agile ceremonies, collaborating with global teams, and delivering high-quality solutions. Core skills: Java, Spring Boot, REST API, Microservices, SQL, Python/Shell scripting, CI/CD, React",
        "job_url": "https://www.linkedin.com/jobs/view/4286655965/?eBP=BUDGET_EXHAUSTED_JOB&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=glraXh%2F7GGOwY5R898WRIA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Fullstack Developer",
        "company": "Tekskills Inc.",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "2 hours ago",
        "description": "About the job\n\nJob Role: Senior - Full Stack (Java +React)\n\nJob Location: Bengaluru \n\nExp level : 5+\n\n\n\n\nMust-Have Skills\n\nBackend: Java, Spring Boot\nFrontend: React.js\nDatabase: PostgreSQL or any other relational database\nMessaging/Event Streaming: Apache Kafka\n\n\n\n\nPreferred Skills (Nice to Have)\n\nBig Data / ETL Tools: Apache NiFi, Apache Spark",
        "job_url": "https://www.linkedin.com/jobs/view/4287263502/?eBP=CwEAAAGYseD-FplnzQPSpte7ja7eli_CUWUuxZmaJUYvrVCTeNMoQy7LRt5sBjDGbKzky2E0K77Pz76DphBuVhKfOGUzNVAjtUElnZUtp4oN9XNIDC22lh3uTbVHZsz6MaEazHZP7rjHp8X_YgZqyUhRWocQJ-vAwbbR4LEk6_ZBQAh8HtgVHneZZ9tY_UBDp6DDvCKRdM905wsaNEPirAwp3n8cSo4nLG0ZC6z684VVzU6k0YGfLqW8krZFH95a7S29ocN3V5ZCqXlZGsUpU47OMkD7aSecqklYJ98r6oJEuqQ0fDy0NlUs3X-AbYlzYJQ4TK9S-uEDC9725wEYwlOcLCvcoJYZFguDzuWBDIFCR8eBMjL_yryKwaZPM9G9ad5WYqpQaKRar4jX3aKGm3HGy1CWBP4JXe7uCE0-Ni9ikkPEXgnn03lbhj4UcsNxL1GbBjR4KTpecpM3MbfcieEx8kj7FVcMEgeqn3ZkVNUX&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=cOu3lDhm9zYMCjy6aBK2Zg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Enterprise Engineering - Software Engineer- Analyst",
        "company": "AQR Capital Management",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "",
        "description": "About the job\n\nAbout AQR Capital Management\n\nAQR is a global investment management firm built at the intersection of financial theory and practical application. We strive to deliver superior, long-term results for our clients by seeking to filter out market noise to identify and isolate what matters most, and by developing ideas that stand up to rigorous testing. Underpinning this philosophy is an unrelenting commitment to excellence in technology — powering our insights and analysis. This unique combination has made us leaders in alternative and traditional strategies since 1998.\n\nAQR takes a systematic, research-driven approach, applying quantitative tools to process fundamental information and manage risk. Our clients include institutional investors, such as pension funds, insurance companies, endowments, foundations, and sovereign wealth funds, as well as financial advisors.\n\nJob description:\n\nThe Team\n\nOur software engineers are responsible for designing and implementing proprietary systems and tools that drive the quantitative strategy research and implementation that powers AQR. Our development teams are small, motivated, and highly productive. Collaborating side-by-side with researchers and portfolio analysts, you will become intimately familiar with the investment philosophy which drives AQR.\n\nYour Role\n\nYou will be a part of the Enterprise Engineering team, which is responsible for design and development of foundational software infrastructure utilized by applications throughout AQR, including:\n\n\nEnterprise Cloud Platform\nCommon Data Platform\nEnterprise Messaging Platform\nRole Based Entitlements System\nApplication Monitoring and Alerting\nApplication Configuration Management\nWorkflows\n\n\nThese foundational services are part of a larger project that streamlines the entire SDLC from project inception through to production and post-production. We build and maintain common development tools and libraries that are implemented in Java, C#, Python and Go.\n\nThe libraries provide business applications with core functionalities needed to build any application within our environment. In addition, we provide standardized cloud-based runtime platform with necessary tooling for all AQR applications.\n\nOur team is also responsible for building common business services which are critical for functioning of overall AQR business.\n\nWe also work with other development teams to ensure that these standardized technologies are adapted across AQR.\n\nWhat You Will Bring\n\n\nBachelor’s/master’s degree in computer science or a related field. \n2+ years of professional experience in software application development. \nExpertise in writing clean, modular, and maintainable code. \nFamiliarity with AI tools such as Amazon Q, Claude Code, Goose, Open Hands, etc. \nExperience with CI/CD pipelines and tools like Jenkins and Git. \nExperience with SQL databases. \nExperience with testing frameworks to ensure code quality. \nExcellent coding, debugging, and analytical skills. \nAdaptable and proactive, with the ability to contribute to existing products and take initiative in developing proof-of-concepts (POCs) as needed. \nExperience working with complex projects through the software development lifecycle. \nExperience working in a geographically spread-out team. \nExcellent verbal and written communication skills. \nHands on programming experience with mastery over at least one programming language: Java, Python, C#, GO, and Angular. \nExperience with multiple languages is a plus. \n\n\nWho You Are\n\n\nYou possess thoughtfulness, making you an ideal fit for a collaborative and team-focused environment. \nYou are industrious and keen to learn in a fast-moving and innovative setting. \nYou uphold principles of intellectual honesty, transparency, and openness. \nYou love solving problems of large-scale technology.",
        "job_url": "https://www.linkedin.com/jobs/view/4271105427/?eBP=BUDGET_EXHAUSTED_JOB&refId=evhJZ1Mp1G%2FraXIVhJcH8w%3D%3D&trackingId=tj04DrVKVd4oXPuXMrDIUg%3D%3D&trk=flagship3_search_srp_jobs"
    }
]