[
    {
        "title": "Junior Java Software Engineer",
        "company": "Gini Talent",
        "location": "India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nJunior Java Software Engineer (Remote)\n\n\n\n\nWe are looking for a Junior Java Software Engineer!\n\n\n\n\nAbout Gini Talent\n\nFounded in 2019 in Istanbul, Gini Talent is a fast-growing, technology-driven staffing and recruitment company. We specialize in contract, temporary, and permanent talent solutions across IT, marketing, creative, and finance roles. Headquartered in Istanbul, with offices in London, New Jersey, and Dubai, we serve clients across 14 countries. Certified with ISO 9001 and ISO 27001, Gini Talent is recognized for its innovative recruitment technologies and AI-powered solutions that enhance the hiring experience for clients and candidates alike.\n\n\n\n\nResponsibilities\n\nDevelop tools and applications according to technology best practices\nParticipate actively in the full software development cycle\nPropose technical strategies, architecture, and solutions that meet overall business requirements\nFollow and work according to software development standards and methodologies\nParticipate in development estimation sessions\nIdentify potential improvements\nCollaborate with internal and external stakeholders\n\n\n\n\nRequirements\n\nMaximum of 1 year of experience excluding internships (ideally 5–6 months in software development)\nStrong knowledge of Java\nSolid understanding of OOP principles, Data Structures, Algorithms, and Design Patterns\nExperience in Agile development\nProactivity and motivation to learn\nA mindset of delivering high-quality code\nExcellent communication skills\n\n\n\n\nWhat’s in it for you?\n\n100% Remote work opportunity with flexible collaboration across global teams\nExposure to diverse industries and challenging international projects\nContinuous learning environment with professional growth opportunities\n\n\n\n\nApply and follow the Gini Talent page!",
        "job_url": "https://www.linkedin.com/jobs/view/4285607614/?eBP=CwEAAAGYuTWwyROQ2yL-pR9vHfZ-1C7ykgq1YFoqJCnhF_JWsrrIDoFB_0zLA1vRdTAdamdzrMrPkYldigAxmi-SkL_lV4ttPi_NOEGZq1vQSIYsUwYEpsQrZP5jAtaTc_T-5MbiOGx01CM-De9gF94UnST4vU7zMu8YsnQ1ahVSz-I2J9nOLIRa-cbP1EFIROhXpbCmur4tsk1cw4FjyKHzvL2OdOYZ8-FdrZ1IgReklPbCjVkeOZDOvFmfQi_SxFh-HzI4OGHzlr7qTCXKTW5QqzHkzbqyY8E_69gzgZtuCBPnSYnSLCTUagrZ9kWL5nTgzpzgmGDG-nqmMn5fHkffPNdFH83UJa5o2JgHrXOEmnrM2ZDcgDGICvfBDEq8COMSw937zxn1jXwfALddEZaqfFGeGX0yz9oPRVo5wjXW3-v7GGJ0nEcuwuet1O2jJArzOMjX2nUN-d95DxTprge9xnrshh4JcWR7AqCGOY2nIBBCYi6ZVbx14CScdI3mtfoMujALiEwhgDFH6t_i&refId=1HZtB1XqBWTI8xUm56M5JA%3D%3D&trackingId=mhkxi5TTBKqPq6BInqQ55A%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java developer",
        "company": "Barclays",
        "location": "Pune, Maharashtra, India",
        "date_posted": "2 days ago",
        "description": "About the job\n\nJoin us as a Java developer at Barclays, where you'll take part in the evolution of our digital landscape, driving innovation and excellence. You'll harness cutting-edge technology to revolutionize our digital offerings, ensuring unparalleled customer experiences. As a part of the team, you will deliver technology stack, using strong analytical and problem solving skills to understand the business requirements and deliver quality solutions. You'll be working on complex technical problems that will involve detailed analytical skills and analysis. This will be done in conjunction with fellow engineers, business analysts and business stakeholders.\n\nTo be successful as a Java developer you should have experience with:\n\n\n\nWorking knowledge on Java and Angular applications.\nSoftware development lifecycle. \nGood to have working knowledge of JIRA, Confluence, Visio, Service Now and Agile. \nIn depth knowledge of and proven track record in financial services industry working in complex business and architecture environment. \nExcellent overall knowledge of banking application and in depth knowledge of several of the functional modules like security trading, order management, settlement, corporate actions, credit, payments etc. \nStrong analytical and problem solving skills. \nExcellent verbal and written communication.\n\n\n\nSome Other Highly Valued Skills Include\n\n\n\nMasters or Bachelors Degree (preferably in Computer Science/Engineering).\nHands on experience in application development experience, of Oracle PL/SQL , Java, Spring framework, Microservices,API.\nExperience in large IT organisation working in a support environment, supporting mission critical complex systems utilizing a large number of technologies and heavy reliance on batch processing. \nOracle PL/SQL script Knowledge of UNIX, Agile Central, Jira and GitLab, Docker, aPaaS.\n\n\n\nYou may be assessed on key critical skills relevant for success in role, such as risk and controls, change and transformation, business acumen, strategic thinking and digital and technology, as well as job-specific technical skills.\n\nThis role is based in Pune.\n\nPurpose of the role\n\nTo design, develop and improve software, utilising various engineering methodologies, that provides business, platform, and technology capabilities for our customers and colleagues.\n\nAccountabilities\n\n\n\nDevelopment and delivery of high-quality software solutions by using industry aligned programming languages, frameworks, and tools. Ensuring that code is scalable, maintainable, and optimized for performance.\nCross-functional collaboration with product managers, designers, and other engineers to define software requirements, devise solution strategies, and ensure seamless integration and alignment with business objectives.\nCollaboration with peers, participate in code reviews, and promote a culture of code quality and knowledge sharing.\nStay informed of industry technology trends and innovations and actively contribute to the organization’s technology communities to foster a culture of technical excellence and growth.\nAdherence to secure coding practices to mitigate vulnerabilities, protect sensitive data, and ensure secure software solutions.\nImplementation of effective unit testing practices to ensure proper code design, readability, and reliability.\n\n\n\nAnalyst Expectations\n\n\n\nTo perform prescribed activities in a timely manner and to a high standard consistently driving continuous improvement.\nRequires in-depth technical knowledge and experience in their assigned area of expertise\nThorough understanding of the underlying principles and concepts within the area of expertise\nThey lead and supervise a team, guiding and supporting professional development, allocating work requirements and coordinating team resources.\nIf the position has leadership responsibilities, People Leaders are expected to demonstrate a clear set of leadership behaviours to create an environment for colleagues to thrive and deliver to a consistently excellent standard. The four LEAD behaviours are: L – Listen and be authentic, E – Energise and inspire, A – Align across the enterprise, D – Develop others.\nOR for an individual contributor, they develop technical expertise in work area, acting as an advisor where appropriate.\nWill have an impact on the work of related teams within the area.\nPartner with other functions and business areas.\nTakes responsibility for end results of a team’s operational processing and activities.\nEscalate breaches of policies / procedure appropriately.\nTake responsibility for embedding new policies/ procedures adopted due to risk mitigation.\nAdvise and influence decision making within own area of expertise.\nTake ownership for managing risk and strengthening controls in relation to the work you own or contribute to. Deliver your work and areas of responsibility in line with relevant rules, regulation and codes of conduct.\nMaintain and continually build an understanding of how own sub-function integrates with function, alongside knowledge of the organisations products, services and processes within the function.\nDemonstrate understanding of how areas coordinate and contribute to the achievement of the objectives of the organisation sub-function.\nMake evaluative judgements based on the analysis of factual information, paying attention to detail.\nResolve problems by identifying and selecting solutions through the application of acquired technical experience and will be guided by precedents.\nGuide and persuade team members and communicate complex / sensitive information.\nAct as contact point for stakeholders outside of the immediate function, while building a network of contacts outside team and external to the organisation.\n\n\n\nAll colleagues will be expected to demonstrate the Barclays Values of Respect, Integrity, Service, Excellence and Stewardship – our moral compass, helping us do what we believe is right. They will also be expected to demonstrate the Barclays Mindset – to Empower, Challenge and Drive – the operating manual for how we behave.",
        "job_url": "https://www.linkedin.com/jobs/view/4282892487/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=1HZtB1XqBWTI8xUm56M5JA%3D%3D&trackingId=CPAoSgj%2B4HXi8vstfuWTbQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Software Engineer",
        "company": "Riddhima Enterpise",
        "location": "India",
        "date_posted": "4 hours ago",
        "description": "About the job\n\nRole Description\n\nThis is a full-time remote role for a Java Software Engineer. The Java Software Engineer will be responsible for designing, developing, and maintaining software applications. Day-to-day tasks include programming, implementing microservices, working with the Spring Framework, and developing software using Java. The engineer will collaborate with cross-functional teams to define, design, and ship new features.\n\n\n\n\nQualifications\n\nStrong skills in Java programming\nExperience with the Spring Framework\nKnowledge of Microservices architecture\nProficiency in software development principles and methods\nExcellent problem-solving and analytical skills\nAbility to work independently and remotely\nBachelor's degree in Computer Science, Engineering, or a related field\nExperience in the software industry is a plus",
        "job_url": "https://www.linkedin.com/jobs/view/4287086162/?eBP=CwEAAAGYuTWwyXb0CkAkBWe3rXLxoShPdm-BLcKJtXRyJvnY09FyDjY6p7yScmq9948Y8TVrDmGI-rbqSyOFoTDk3gOAWa4wGngJenoqLM061cRUVpYQDdFNbYMW8yeH-zVswzomqyIZTpX90OiH5Dt0nb7Msok0S1khXq0qj39tbwk59-_i6WFT615QUJ8DYx_KzNQ5fO_o1cSG-xfMbIwJbN1vZn2_7TPUljnZbHmDZ-dyyfkgi1s_ZM92GoajxBFXWn3kWu9Zhw4_lDffOmnwwUjfzF_YKVVgmNx2YlxtcOs66uwtM2hdD4l7_GdmzdJW9_-qLHf0F4oejoz6rAg3aRWXLHPal6XZMp3E3bIdEtMgpMIAMQSKFK7BfdiZbJ8E9etnmDsbLODvj4uGoAQCxQz9EldxVop-ATuhZi0OtjBuhboa1Xebs_GhMtOqm3_3kT70zUvHdpEOTwXEV00uZ7TkVi9BpLwbEXJAp3MP7LicBz_ms_6cUgVFu0fnNuQ3NyQcmJ7XuhYcB9lLilApxaNeFD9FHMvM67EXU7OCSuZ6meH1s7Gj65lpxw&refId=1HZtB1XqBWTI8xUm56M5JA%3D%3D&trackingId=vpUQixetSiKtvvnS%2BCk9Gg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Junior Java Developer - Entry Level",
        "company": "Stier Solutions Inc",
        "location": "India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nJob Title: Junior Java Developer - Entry Level\n\n Location: India,Remote\n\n Job Type: Full-time \n\nAbout the Role:\n\n We are looking for an enthusiastic and motivated Junior Java Developer to join our development team. As an entry-level developer, you will assist in designing, coding, testing, and maintaining Java-based applications under the guidance of senior developers. This is an excellent opportunity for fresh graduates or those starting their career in software development.\n\nKey Responsibilities:\n\nAssist in developing and maintaining Java applications according to project requirements.\nWrite clean, efficient, and well-documented code.\nDebug and troubleshoot issues in existing applications.\nCollaborate with the team to gather requirements and contribute to technical solutions.\nParticipate in code reviews to ensure quality and best practices.\nLearn and apply new Java technologies, frameworks, and tools.\n\nRequired Skills & Qualifications:\n\nBachelor’s degree in Computer Science, Information Technology, or related field.\nBasic understanding of Java, OOP principles, and data structures.\nFamiliarity with HTML, CSS, and JavaScript (added advantage).\nKnowledge of databases (MySQL, PostgreSQL, or similar).\nStrong problem-solving skills and willingness to learn.\nGood communication and teamwork abilities.\n\nPreferred Qualifications:\n\nInternship or project experience in Java development (academic projects included).\nUnderstanding of version control systems like Git.",
        "job_url": "https://www.linkedin.com/jobs/view/4286464140/?eBP=CwEAAAGYuTWwyRWXscizNBgdIA4mxpHmKf8gkKlv26_zI-2_ytYMROvhK_3i6qiWugLbnBjCjMNHFWb8dN5WEVbQ8kZgG8pYhEvetkFAkEufi3ei7ySzPHIuCRH_DGT_pTT3Vv50PVayMk6f8T-tlWbxpmdkQfouN2GT6P_qleaYi-YUBt7xztMKkjPXuq7LoP7KGOkSbL0o9anFWgKotyNMTLIS3y1KSlaDTgO0FF8ZSA1I_QxhBqwv2UlTIE875AXw4P5vIOoJtjQq3O-n0lUlTBXqm014G_gmS2tnJjyBtqrzw4O1kMhA4zylaNSU9XPKQoerf8zWhxzcKrN8HS8WsrbbiDyKd42rvwHTVhBvddtLVQQt-O9YLXtN8s6euBguKT58unLWukcRS7N6apxCNxIXq3ANakpdF1CFYyYUmw1T7P04GUNJzA6xVOQ3EVOFpRLBbGFxhlt68xqipsX36hKdKfT5fn-QeqpkwS9hR52K8OYHDDLFKL7ufmeyLALZ1hdrX7q0_5HuuBDAZo8&refId=1HZtB1XqBWTI8xUm56M5JA%3D%3D&trackingId=MoKgeZD06QgZuZA8MfEfQA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer",
        "company": "Autostock Digital Limited",
        "location": "India",
        "date_posted": "11 hours ago",
        "description": "About the job\n\nRole Overview\n\nWe are hiring a Java Backend Developer to work remotely from India. The role focuses on backend development using Spring Boot, JAX-RS, JPA, and MySQL, with strong emphasis on leveraging AI tools to boost productivity, problem-solving, and automation. Knowledge of JSF is an advantage but not required.\n\nResponsibilities\n\nDevelop and maintain backend services with Spring Boot and JAX-RS\nDesign RESTful APIs and integrate with frontend/third-party services\nImplement efficient data access using JPA and optimize MySQL queries\nUse AI tools (e.g., GitHub Copilot, ChatGPT, Gemini, AI-powered IDEs) to improve code quality and speed up development\nStay updated with AI trends and apply them to workflows and automation\nCollaborate with international team members across time zones\n\nRequirements\n\n2–6 years of Java backend development experience\nStrong expertise in Spring Boot, JAX-RS, JPA, MySQL\nFamiliarity with REST API design principles\nGood problem-solving and debugging skills\nExperience with Git and collaborative workflows\nAI Proficiency: Comfortable using AI tools for coding, debugging, documentation, and automation\nBonus: Knowledge of JSF",
        "job_url": "https://www.linkedin.com/jobs/view/4287030534/?eBP=CwEAAAGYuTWwyUItedzBDxo9D3JDp7KGXITqKze5khcT-94oVL13dA_PovNa28KZ-arwD-_MQ58wsNupcWNYdUF0Zc2A8lsG4b5kycAdyR9GwR5N-ql4byBlEPxuKdHbigvUFHAsMSFbNtYE5tkywxWAKlfAFoysMigIRn_Yz352zYLaj-bq2ftiO1NVYBhHOrRiGvWJaEZF3WFV8ytR49nkY5F5d-abKgdN7100UD2gShnrmVUM-XZU8wumT9JKbZTExwEoa5_yXFd86Y9JTHelN7vIAz80dHN7mbVAh1DI_cBtJEw5fJOfPOKm8UGjba8n7EbqI85HXq8e2fC1h7HGigzT89nzOJkbVpQwJ_lwRBiQhWOMt1KGIIc7IYA-YFyjWydUt48GYXVjmSp7nNKrpvzdzDbLkSfFraCfaJ_-9l6AEyleQeqhS9kXjn4n_wd0dCvXvExFtr1MH0kgM1v3cBdJYlRoLJ5IfUUeaBme__jPGFvb1D6ABYsHlEWuXL4rDp15LScpWWlUBZCtBFsmUNt8nhpqeOVWRYs6bDismdZg&refId=1HZtB1XqBWTI8xUm56M5JA%3D%3D&trackingId=yhKqt5sODNAfW5MkeWWcRg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer",
        "company": "Barclays",
        "location": "Pune, Maharashtra, India",
        "date_posted": "5 days ago",
        "description": "About the job\n\nJoin us as a “Java Developer\" at Barclays, where you'll spearhead the evolution of our digital landscape, driving innovation and excellence. You'll harness cutting-edge technology to revolutionise our digital offerings, ensuring unapparelled customer experiences. As a part of the team, you will deliver technology stack, using strong analytical and problem solving skills to understand the business requirements and deliver quality solutions. You'll be working on complex technical problems that will involve detailed analytical skills and analysis. This will be done in conjunction with fellow engineers, business analysts and business stakeholders.\n\nTo be successful as a “Java Developer\", you should have experience with:\n\nBasic/ Essential Qualifications\n\n\n\nExperience with Java.\nExperience with Spring.\nExperience with Junit.\nExperience with Oracle PL/SQL.\nExperience with SQL.\n\n\n\nDesirable Skillsets/ Good To Have\n\n\n\nInvestment Banking and capital markets knowledge\nEquity Derivative Knowledge\n\n\n\nYou may be assessed on key critical skills relevant for success in role, such as risk and controls, change and transformation, business acumen, strategic thinking and digital and technology, as well as job-specific technical skills.\n\nThis role will be based out of Pune.\n\nPurpose of the role\n\nTo design, develop and improve software, utilising various engineering methodologies, that provides business, platform, and technology capabilities for our customers and colleagues.\n\nAccountabilities\n\n\n\nDevelopment and delivery of high-quality software solutions by using industry aligned programming languages, frameworks, and tools. Ensuring that code is scalable, maintainable, and optimized for performance.\nCross-functional collaboration with product managers, designers, and other engineers to define software requirements, devise solution strategies, and ensure seamless integration and alignment with business objectives.\nCollaboration with peers, participate in code reviews, and promote a culture of code quality and knowledge sharing.\nStay informed of industry technology trends and innovations and actively contribute to the organization’s technology communities to foster a culture of technical excellence and growth.\nAdherence to secure coding practices to mitigate vulnerabilities, protect sensitive data, and ensure secure software solutions.\nImplementation of effective unit testing practices to ensure proper code design, readability, and reliability.\n\n\n\nAssistant Vice President Expectations\n\n\n\nTo advise and influence decision making, contribute to policy development and take responsibility for operational effectiveness. Collaborate closely with other functions/ business divisions.\nLead a team performing complex tasks, using well developed professional knowledge and skills to deliver on work that impacts the whole business function. Set objectives and coach employees in pursuit of those objectives, appraisal of performance relative to objectives and determination of reward outcomes\nIf the position has leadership responsibilities, People Leaders are expected to demonstrate a clear set of leadership behaviours to create an environment for colleagues to thrive and deliver to a consistently excellent standard. The four LEAD behaviours are: L – Listen and be authentic, E – Energise and inspire, A – Align across the enterprise, D – Develop others.\nOR for an individual contributor, they will lead collaborative assignments and guide team members through structured assignments, identify the need for the inclusion of other areas of specialisation to complete assignments. They will identify new directions for assignments and/ or projects, identifying a combination of cross functional methodologies or practices to meet required outcomes.\nConsult on complex issues; providing advice to People Leaders to support the resolution of escalated issues.\nIdentify ways to mitigate risk and developing new policies/procedures in support of the control and governance agenda.\nTake ownership for managing risk and strengthening controls in relation to the work done.\nPerform work that is closely related to that of other areas, which requires understanding of how areas coordinate and contribute to the achievement of the objectives of the organisation sub-function.\nCollaborate with other areas of work, for business aligned support areas to keep up to speed with business activity and the business strategy.\nEngage in complex analysis of data from multiple sources of information, internal and external sources such as procedures and practises (in other areas, teams, companies, etc).to solve problems creatively and effectively.\nCommunicate complex information. 'Complex' information could include sensitive information or information that is difficult to communicate because of its content or its audience.\nInfluence or convince stakeholders to achieve outcomes.\n\n\n\nAll colleagues will be expected to demonstrate the Barclays Values of Respect, Integrity, Service, Excellence and Stewardship – our moral compass, helping us do what we believe is right. They will also be expected to demonstrate the Barclays Mindset – to Empower, Challenge and Drive – the operating manual for how we behave.",
        "job_url": "https://www.linkedin.com/jobs/view/4281210500/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=ZFNJ%2BOaPexr7a6z0mQNwlA%3D%3D&trackingId=Jl1Z2Vevhf2LBM%2Foxz8ZRw%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Junior Java Springboot Developer",
        "company": "Infosys",
        "location": "Bengaluru East, Karnataka, India",
        "date_posted": "1 day ago",
        "description": "About the job\n\nPrimary skills:Technology->Java->Java - ALL,Technology->Middleware Administration->Middleware Administration-Others\n\n\nA day in the life of an Infoscion\n\n\n As part of the Infosys Delivery team, you will work on implementing designs, developing high quality programs and systems, partnering with our clients to ensure high quality deliverables.\n You will create technical artifacts and be the first point of contact in responding to production issues and conducting any technical analysis to arrive at solutions\n You will share your learnings from projects through knowledge management initiatives and leverage knowledge from other projects to drive high efficiency and effectiveness\n You will be a key contributor to building efficient programs/systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!\n Advanced conceptual understanding of at least one Programming Language\n Advanced conceptual understanding of one database and one Operating System\n Understanding of Software Engineering with practice in at least one project\n Ability to contribute in medium to complex tasks independently\n Exposure to Design Principles and ability to understand Design Specifications independently\n Ability to run Test Cases and scenarios as per the plan\n Ability to accept and respond to production issues and coordinate with stake holders\n Good understanding of SDLC\n Analytical abilities\n Logical thinking\n Awareness of latest technologies and trends",
        "job_url": "https://www.linkedin.com/jobs/view/4286556052/?eBP=CwEAAAGYuTW31qExBYJw8j3hZactl45rB9rGrVWbIogwGvj7_wUxb0PbbhsaKB0h6NZEdF8jW4v4eyVuD9GLgj65DfWvAiass9ctJS953d7LzG8OQv3I3AfPQM7LrEcsxVrfazYorzCgaUYVpRa4tWz6B48sy5Ob7TyN8OOmZAwRf7j4mqMbM4tRTAX-apqXpQBl6MESDoM5mqctfbWVoIf6M4sLd65NAeT8Qj1GaLZMIwT76FXMTUQHHDH1mI4gSodzMSUvSuallARWDRpCpsIvPpFNz0wbLAMeaOu4FTyusdmXy3NuAxCQPQmUkxnAKDaJdvjv9gRiOFuGBXsUwmlsQqoNaiS7-1onGEk0UlQJCPJm0OmMjSjIMIozFgFhRhE5cHUlDi-1uBGlFStQDuSftPvn_dInlienTBj7r66dmL-MwCnCzI3_J7Ddc-dl6mxBw5CLEoc1XwRjtFpdq7550eH8oPSdr2_vlPRnN1NYlYJQoOpxB7Qly0VDp-y_f04X7MVSj1sCVipN5eR3O-U-EQ&refId=ZFNJ%2BOaPexr7a6z0mQNwlA%3D%3D&trackingId=Te4LFCRoaBp1lM%2BQM87Thw%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer",
        "company": "MSCI Inc.",
        "location": "Pune, Maharashtra, India",
        "date_posted": "4 days ago",
        "description": "About the job\n\nYour Team Responsibilities\n\n\nDevelop New Offerings under the ESG API Suite of applications.\nMaintain the ESG API applications product life cycle and support it.\nEngage with Product, TPM & SRE for the daily functioning of the applications.\nActively develop new modules and functionalies for the projects in alignment with the team lead.\nActively participate in code reviews and finds ways to improve the performance of the applicaitons.\nFix the vulnerabilities and keep the applications free from securities and vulnerablities.\nDevelop Unit tests and maintain the code quality as per MSCI standards.\n\n\nYour Key Responsibilities\n\n\nMaintain the ESG API applications product life cycle and support it.\nActively develop new modules and functionalies for the projects in alignment with the team lead.\nActively participate in code reviews and finds ways to improve the performance of the applicaitons.\nFix the vulnerabilities and keep the applications free from securities and vulnerablities.\nDevelop Unit tests and maintain the code quality as per MSCI standards.\n\n\nYour Skills And Experience That Will Help You Excel\n\n\n2-4 years of experience in Java Programming along with NoSQL database esp Cassandra.\nExperience in Python programming is also good to have.\nCandidate should have experience is handling huge volume of data and processing.\nCandidate should have experience is low latency programming in java and can optimise the code.\nCandidate should have experiennce in multi threading in Java/Python.\n\n\nAbout MSCI\n\nWhat we offer you\n\n\nTransparent compensation schemes and comprehensive employee benefits, tailored to your location, ensuring your financial security, health, and overall wellbeing.\nFlexible working arrangements, advanced technology, and collaborative workspaces.\nA culture of high performance and innovation where we experiment with new ideas and take responsibility for achieving results.\nA global network of talented colleagues, who inspire, support, and share their expertise to innovate and deliver for our clients.\nGlobal Orientation program to kickstart your journey, followed by access to our Learning@MSCI platform, LinkedIn Learning Pro and tailored learning opportunities for ongoing skills development.\nMulti-directional career paths that offer professional growth and development through new challenges, internal mobility and expanded roles.\nWe actively nurture an environment that builds a sense of inclusion belonging and connection, including eight Employee Resource Groups. All Abilities, Asian Support Network, Black Leadership Network, Climate Action Network, Hola! MSCI, Pride & Allies, Women in Tech, and Women’s Leadership Forum.\n\n\nAt MSCI we are passionate about what we do, and we are inspired by our purpose – to power better investment decisions. You’ll be part of an industry-leading network of creative, curious, and entrepreneurial pioneers. This is a space where you can challenge yourself, set new standards and perform beyond expectations for yourself, our clients, and our industry.\n\nMSCI is a leading provider of critical decision support tools and services for the global investment community. With over 50 years of expertise in research, data, and technology, we power better investment decisions by enabling clients to understand and analyze key drivers of risk and return and confidently build more effective portfolios. We create industry-leading research-enhanced solutions that clients use to gain insight into and improve transparency across the investment process.\n\nMSCI Inc. is an equal opportunity employer. It is the policy of the firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, gender, gender identity, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy (including unlawful discrimination on the basis of a legally protected parental leave), veteran status, or any other characteristic protected by law. MSCI is also committed to working with and providing reasonable accommodations to individuals with disabilities. If you are an individual with a disability and would like to request a reasonable accommodation for any part of the application process, please email Disability.Assistance@msci.com and indicate the specifics of the assistance needed. Please note, this e-mail is intended only for individuals who are requesting a reasonable workplace accommodation; it is not intended for other inquiries.\n\nTo all recruitment agencies\n\nMSCI does not accept unsolicited CVs/Resumes. Please do not forward CVs/Resumes to any MSCI employee, location, or website. MSCI is not responsible for any fees related to unsolicited CVs/Resumes.\n\nNote on recruitment scams\n\nWe are aware of recruitment scams where fraudsters impersonating MSCI personnel may try and elicit personal information from job seekers. Read our full note on careers.msci.com",
        "job_url": "https://www.linkedin.com/jobs/view/4282219322/?eBP=CwEAAAGYuTW31_SIO2U3kDsD8V71NzEpHU3R4bkqgkEODC_x-lDOJOsDdTHy6ZIwhLCiIhdeUDfBYedEZV5YwJge_iCQ3xElg5LkeXDpOXZe7LBnPwgB5v4-2I7CzzdHvgftePudoUEFTr9dFFYpVRFZ6McgT8USgXkCgPQn0NcXQrssBB9LYIULjPe4KYhXRkhQsZiT9dcvVh0fBgNm9iFnvZNhSFOY_-R10nZiy-MDJWeQEMus2QgqT6LnROptxJnUbhl1XEVSn8WqDdGvSFgZxWJfX4mGHWBjoR61AhhnV5bLePlPNStkyMCBrekDT5-InYcQUOvb2zJyWlnWuVkHEWPiUsHHjJtQdrH6USFYxBIM5syMQU8PgtQMdYTCPm48m0uYLma6dDcYKVj1PA5wAF5FZncq2Mf5JFPZ2WdwIPGGfL7hQf8GD1fH97cuLG-oP-gL79SXqm4P8co3k_Ah23AnSL5Nnzqf9QKpDE_rQmTvDVcFZCNe42azmZF3LTjHuCZ2p3jpIOTV0LNKi_-rvQ&refId=ZFNJ%2BOaPexr7a6z0mQNwlA%3D%3D&trackingId=%2BQF9rYEu98%2BhOwxcDQr1Dg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer",
        "company": "Virtusa",
        "location": "Bangalore Urban, Karnataka, India",
        "date_posted": "6 days ago",
        "description": "About the job\n\nPlease Find The JD Below\n\nJob description for Java developer\n\nBuilding the web application using Java, Spring Boot.\n\nBuild REST APIs and SDKs following best practices.\n\nFlexibility to work on various platforms Skills\n\nArchitecture and development of REST APIs and microservices\n\nRequired Skills\n\nShould be excellent in Java .\n\nShould be excellent in OOPS concepts & Java Collections\n\nShould be excellent in Spring Boot/Spring/hibernate.\n\nShould have good exposure to Hibernate or any other ORM\n\nShould have worked on REST API implementation and microservices implementation\n\nHaving knowledge on Excel operations would be added advantage.\n\n\n\nDesired Skills and Experience\n\nSQL, Hibernate, OOPS, ORM, Java, Spring Boot, REST API",
        "job_url": "https://www.linkedin.com/jobs/view/4281032665/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=ZFNJ%2BOaPexr7a6z0mQNwlA%3D%3D&trackingId=FeE6EH90BhVU%2B9bFVlJwgQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer",
        "company": "Adroit Innovative Solutions Inc",
        "location": "India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nRole: Java Developer\n\nDuration: 12 Month\n\nLocation: Remote (PAN INDIA)\n\nTimings: Full Time (As per company timings)\n\nNotice Period: within 15 days or immediate joiner\n\nExperience: 0-2 years\n\nAbout The Job\n\nJob Description\n\n\nBachelor's degree in Computer Science or equivalent experience.\n1 years of Java development experience with a strong understanding of OOPS, Multithreading, and Data Structures.\nProficiency in Java technologies including Spring, Hibernate, Struts, JSP.\nExperience in enterprise web application components like Tomcat and JBOSS.\nKnowledge of database development and MS-SQL.\nAbility to contribute to all phases of the development lifecycle.\nHands-on experience with Java frameworks like Spring MVC, Spring Boot.\nUnderstanding of design patterns, data structures, algorithms, and Java 8+.\nExperience in developing RESTful microservices and web services.\nExperience in software development using J2EE, Java Servlets, and Struts 2.\nStrong knowledge of Java programming standards and best practices.\nGood knowledge on Core Java, Good knowledge on multi-threading.\nGood knowledge on Design patterns, collection framework, Concurrency packages, DS/Algo.\nGood knowledge on Data Structures (Hash map/Linked list/palindromic Sequence/Hashtag) and Algorithms for Problem Solving",
        "job_url": "https://www.linkedin.com/jobs/view/4285981006/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=ZFNJ%2BOaPexr7a6z0mQNwlA%3D%3D&trackingId=ISt3Ijqq24p8TiBFCGmuHg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer",
        "company": "Scouto AI",
        "location": "Chennai, Tamil Nadu, India",
        "date_posted": "4 days ago",
        "description": "About the job\n\nJob Description:\n\nWe are looking for a Java Developer with experience in backend development using frameworks like Spring Boot and Hibernate. The role involves building and maintaining RESTful APIs and working closely with the team to deliver high-quality software solutions.\n\nRoles & Responsibilities:\n\n\nDesign, develop, test, and maintain high-quality backend applications using Java.\nBuild RESTful APIs and ensure seamless integration with frontend systems.\nWork with frameworks such as Spring Boot, Hibernate, or JPA.\nWrite clean, maintainable, and well-documented code.\nCollaborate with cross-functional teams including frontend developers, QA, and product managers.\nTroubleshoot and debug applications, ensuring high performance and responsiveness.\nParticipate in code reviews and contribute to team knowledge sharing.\nWrite unit and integration tests to ensure code quality.\n\n\nQualifications:\n\n\nStrong proficiency in Core Java.\nHands-on experience with Spring Boot and Spring Framework.\nSolid understanding of building and consuming RESTful APIs.\nExperience with Hibernate, JPA, or other ORM tools.\nFamiliarity with SQL databases like MySQL, PostgreSQL.\nVersion control using Git.\nGood understanding of object-oriented programming and design patterns.\n\n\nQualifications:\n\n\nBachelor’s degree in Computer Science, Engineering, or a related field.\n2 to 5 years of relevant experience in backend Java development.\n\n\nSkills: Java,Spring Boot,Hibernate,JPA,Troubleshooting,Debugging,Core Java,Spring Framework,SQL,MySQL,PostgreSQL,Git,Backend Development",
        "job_url": "https://www.linkedin.com/jobs/view/4284134064/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=ZFNJ%2BOaPexr7a6z0mQNwlA%3D%3D&trackingId=I0uEzNnbA5SA%2F6fCGhVRSQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Developer with Microservices",
        "company": "Capco",
        "location": "Pune, Maharashtra, India",
        "date_posted": "6 days ago",
        "description": "About the job\n\nAbout Us\n\n“Capco, a Wipro company, is a global technology and management consulting firm. Awarded with Consultancy of the year in the British Bank Award and has been ranked Top 100 Best Companies for Women in India 2022 by Avtar & Seramount. With our presence across 32 cities across globe, we support 100+ clients across banking, financial and Energy sectors. We are recognized for our deep transformation execution and delivery. \n\nWHY JOIN CAPCO?\n\nYou will work on engaging projects with the largest international and local banks, insurance companies, payment service providers and other key players in the industry. The projects that will transform the financial services industry.\n\nMAKE AN IMPACT\n\nInnovative thinking, delivery excellence and thought leadership to help our clients transform their business. Together with our clients and industry partners, we deliver disruptive work that is changing energy and financial services.\n\n#BEYOURSELFATWORK\n\nCapco has a tolerant, open culture that values diversity, inclusivity, and creativity.\n\nCAREER ADVANCEMENT\n\nWith no forced hierarchy at Capco, everyone has the opportunity to grow as we grow, taking their career into their own hands.\n\nDIVERSITY & INCLUSION\n\nWe believe that diversity of people and perspective gives us a competitive advantage.\n\nIn This Role, You Will\n\n\n Work towards priorities defined by product owners in the business to collaboratively build out the Product/Platform\n To have a clear view of technology strategy for design & delivery of the technical aspects of the product…focusing on not only business delivery but constant focus on remediating tech debt.\n Responsible for delivering tasks end to end with high quality and in line with design and architecture laid out. Strive towards no post implementation issues.\n Production support, environment management, release support and automation implementation to be part of day job.\n Ensuring that quality (code / performance) and discipline (TDD, BDD, unit, JIRA usage etc) are always maintained.\n Maintaining our Agile and delivery principles.\n Working with UX and Architecture to ensure that Design Driven ethos is upheld.\n Collaboration with business and team along with DevOps principles maintained all the time.\n\n\nTo be successful in this role, you should meet the following requirements:\n\n\n Demonstrable experience of Continuous Delivery software development methods, including TDD and automated testing (including non-functional performance testing).\n Experience of working on high volume data integration and throughput requirements (profiling)\n Experience of micro service architecture\n Experience of REST services.\n Experience of Developing microservices and deploying on Containerized environment\n A background of solid architectural work is advantageous.\n\n\nTechnical Specifics\n\n\n Java 17 or above, Spring Boot components, Spring framework\n Proficiency with ServiceNow development, such as scripting, workflows, and integrations.\n Oracle, PostgreSQL, MySQL\nSome experience with NoSQL, Elastic, Google Cloud, Kubernetes, Ansible, AI/ML is good to have.\n\n\nNon-Technical\n\n\n Strong communication skills – experience of interfacing with IT Lead/Delivery Manager, Architect, business Product Owners and IT offshore teams.\n Model – Strive to be Role Model for the peers.",
        "job_url": "https://www.linkedin.com/jobs/view/4283195104/?eBP=BUDGET_EXHAUSTED_JOB&refId=ZFNJ%2BOaPexr7a6z0mQNwlA%3D%3D&trackingId=Ajvg6tY%2B9nBqFyVfkEuGrg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python Developer",
        "company": "PropGrow",
        "location": "Gurugram, Haryana, India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nCompany Description\n \n\nAt PropGrow, we are transforming the real estate investment experience in Gurugram's residential and commercial property markets, making it easier and more rewarding for both seasoned investors and first-time buyers. Our mission is to simplify real estate investment complexities through personalized, data-driven guidance that aligns high-growth opportunities with investor goals. Leveraging advanced technology, market surveys, and robust data analytics, we identify prime investment opportunities focused on maximizing ROI. We foster long-term relationships to ensure our clients feel valued and supported at all stages of their journey. Join PropGrow to be part of a community dedicated to building wealth and achieving real estate success.\n\n\n Role Description\n \n\nThis is a full-time on-site role for a Python Developer located in Gurugram. The Python Developer will be responsible for back-end web development, developing software solutions, utilizing object-oriented programming (OOP) principles, and working with various databases. Day-to-day tasks involve designing, coding, testing, debugging, and maintaining Python applications to enhance our real estate investment platform and ensure seamless user experiences.\n\n\n Qualifications\n \nProficiency in Back-End Web Development and Software Development\nStrong skills in Object-Oriented Programming (OOP) and general Programming\nExperience working with Databases\nExcellent problem-solving skills and attention to detail\nAbility to work collaboratively in a team environment on-site\nBachelor's degree in Computer Science, Information Technology, or a related field",
        "job_url": "https://www.linkedin.com/jobs/view/4281613603/?eBP=BUDGET_EXHAUSTED_JOB&refId=uG1iR7Nhez072Janp8YyJQ%3D%3D&trackingId=eZRn6O7XDLxK8voLLSoyPQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python Developer",
        "company": "SOPEONOW",
        "location": "India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nCompany Description\n\n\n\n\nSOPEONOW is a healthcare technology company focused on enabling healthcare providers to utilise real-time data to enhance patient care, service, and safety. Our mission is to harness the power of data and machine intelligence to achieve the highest standards in healthcare delivery. We provide consolidated and readily available real-time information to leaders in the healthcare industry, empowering them to make informed decisions and improve every patient experience.\n\n\n\n\nAbout the Role\n\n\n\n\nWe’re hiring a passionate Python Developer to design, develop, and optimise high-performance applications. Whether it’s backend systems, data pipelines, automation, or APIs, you’ll play a key role in shaping our technical landscape.\n\n\n\n\nKey Responsibilities\n\n\n\n\n· Application Development: Build, test, and maintain Python-based applications, scripts, and tools.\n\n· Backend Services: Develop RESTful APIs and microservices using frameworks like Django, Flask, or FastAPI.\n\n· Data Processing: Implement solutions for data analysis, ETL pipelines, or machine learning integration (Pandas, \n\n NumPy, etc.).\n\n· Automation: Create scripts to streamline workflows, deployments, or system tasks.\n\n· Database Integration: Work with SQL (Postgresql, Mysql) or Nosql (Mongodb) databases and ORM libraries.\n\n· Code Quality: Write clean, modular code with unit tests (pytest, unittest) and documentation.\n\n· Collaboration: Partner with cross-functional teams (frontend, DevOps, data scientists) to deliver end-to-end \n\n solutions.\n\n· Performance Tuning: Optimise applications for speed, scalability, and resource efficiency.\n\n· Security: Apply best practices for secure coding and data protection.\n\n· Deployment: Use Docker, Kubernetes, or cloud platforms (AWS, GCP, Azure) for deployment.\n\n\n\n\nRequirements\n\n \n\n Technical Skills:\n\n2+ years of professional Python development experience.\nProficiency in Python frameworks (Django, Flask, FastAPI) and libraries.\nExperience with relational/non-relational databases.\nFamiliarity with RESTful API design and integration.\nVersion control (Git) and CI/CD pipelines.\nBasic understanding of front-end technologies (HTML, CSS, JavaScript).\n\n\n\n\n Soft Skills:\n\nAn analytical thinking and problem-solving mindset.\nStrong communication and teamwork abilities.\n\n\n\n\nEducation: Bachelor’s in Computer Science, Engineering, or equivalent experience.\n\n\n\n\nPreferred Qualifications\n\nExperience with data science libraries (Pandas, NumPy, SciPy).\nKnowledge of machine learning frameworks (TensorFlow, PyTorch).\nDevOps skills (Docker, Kubernetes, Jenkins).\nFamiliarity with asynchronous programming (asyncio, Celery).\nExperience with cloud-native development (AWS Lambda, serverless).\nContributions to open-source Python projects or a strong GitHub portfolio.\n\n\n\n\nEqual Opportunity Employer:\n\nSOPEONOW celebrates diversity and is committed to creating an inclusive environment for all employees.",
        "job_url": "https://www.linkedin.com/jobs/view/4282476924/?eBP=BUDGET_EXHAUSTED_JOB&refId=uG1iR7Nhez072Janp8YyJQ%3D%3D&trackingId=cpVNzEadlAxw%2BAY%2BwhSqSg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python Developer",
        "company": "Kaabil Finance Private Limited",
        "location": "Jaipur, Rajasthan, India",
        "date_posted": "3 days ago",
        "description": "About the job\n\nKaabil Finance is RBI registered NBFC. We are profitable, well funded and in high growth phase. We are seeking a skilled Python Developer to join our team. The ideal candidate will have experience in web development and possess strong problem-solving skills.\n\n\n\n\nResponsibilities:\n\n- Develop and maintain web applications using Python\n\n- Collaborate with cross-functional teams to design and implement new features\n\n- Troubleshoot and debug issues in existing applications\n\n- Write clean and efficient code\n\n- Conduct code reviews and provide constructive feedback to team members\n\n\n\n\nRequirements:\n\n- Proficient in Python programming language\n\n- Experience in web development using frameworks such as Django or Flask\n\n- Strong problem-solving skills\n\n- Knowledge of database systems, such as MySQL and MongoDB\n\n- Understanding of version control systems, such as Git\n\n- Excellent communication and teamwork skills\n\n\n\n\nJob Location: Jaipur, Rajasthan\n\nSalary: Best in Industry",
        "job_url": "https://www.linkedin.com/jobs/view/4285484174/?eBP=BUDGET_EXHAUSTED_JOB&refId=uG1iR7Nhez072Janp8YyJQ%3D%3D&trackingId=3U67cRxWOZ1VY4Cnc1DP4w%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Junior Python Developer",
        "company": "DehazeLabs",
        "location": "India",
        "date_posted": "3 days ago",
        "description": "About the job\n\nLocation: Remote\n\nJob Type: Full-Time\n\nAbout Us: DehazeLabs is a leading company dedicated to Empowering businesses to swiftly integrate AI solutions for tangible business outcomes. We specialize in delivering innovative AI-driven solutions that drive real-world results. We are looking for a skilled Python Developer to join our team and help us build innovative software solutions.\n\nResponsibilities:\n\n\nDevelop and maintain Python applications and services\nCollaborate with cross-functional teams to design, develop, and deploy high-quality software\nWrite clean, efficient, and well-documented code\nTroubleshoot, debug, and optimize applications for performance and scalability\nParticipate in code reviews and maintain coding standards\nStay up-to-date with the latest industry trends and technologies\n\n\nRequirements:\n\n\nAbility to code in Python and SQL\nKnowledge of databases (e.g., SQL, NoSQL) and data modeling. \nKnowledge of version control systems (e.g., Git)\nExcellent problem-solving skills and attention to detail\nStrong communication and teamwork abilities. \n\n\nPreferred Qualifications:\n\n\nExperience with cloud platforms (e.g., AWS, Azure) is a plus. \nFamiliarity with containerization tools (e.g., Docker) and CI/CD pipelines. \nKnowledge of RESTful APIs and microservices architecture. \n\n\nCompensation Range: ₹2.2L - ₹4.2L",
        "job_url": "https://www.linkedin.com/jobs/view/4284526815/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=uG1iR7Nhez072Janp8YyJQ%3D%3D&trackingId=gLGJY8MaIOCj0iOLLYyIUA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python Developer",
        "company": "Vish Gyana Technology Solutions",
        "location": "Chennai, Tamil Nadu, India",
        "date_posted": "Company review time is typically 1 week",
        "description": "About the job\n\nJob Description - Python Developer (AI/ML)\n\nExperience: 2-3 Years\n\nJob Summary:\n\nWe are looking for a skilled Python Developer with 2-3 years of experience and a strong interest in artificial intelligence and machine learning to join our dynamic team. In this role, your primary focus will be on writing clean, efficient, and scalable Python code for a variety of applications. You will also have the opportunity to work alongside our AI specialists to develop and integrate, contributing to the creation of innovative AI-driven solutions.The ideal candidate is a proficient Python programmer who is passionate about leveraging their skills to build and enhance intelligent systems.\n\nKey Responsibilities:\n\nCore Python Development: Write high-quality, reusable, and testable Python code for various applications and services.\n\nApplication & API Development: Design, build, and maintain robust server-side logic and RESTful APIs using Python frameworks like FastAPI.\n\nAI/ML Integration: Collaborate with the AI team to integrate models into our production systems and applications.\n\nData Handling: Write scripts for data extraction, transformation, and loading (ETL) processes, and work with various databases (SQL and NoSQL) to ensure data is ready for use in AI models.[2]\n\nCode Optimization and Debugging: Analyze and enhance the performance of existing Python applications and debug complex issues.\n\nCollaboration and Version Control: Work closely with front-end developers, product managers, and other engineers using version control systems like Git.\n\nStay Current: Keep up-to-date with the latest trends and advancements in Python development, as well as emerging technologies in AI and machine learning.\n\nRequired Skills and Qualifications:\n\nPython Proficiency: 2-3 years of hands-on experience in Python development, with a deep understanding of its core concepts and data structures.\n\nWeb Frameworks: Demonstrable experience with Python web frameworks such as FastAPI.\n\nDatabase Knowledge: Familiarity with both relational (e.g., PostgreSQL, MySQL) and NoSQL (e.g., MongoDB) databases.\n\nAPI Development: Proven experience in building and consuming RESTful APIs.\n\nAI/ML Libraries: Experience with key Python libraries for data science and machine learning\n\nVersion Control: Proficiency with Git and collaborative development workflows.\n\nProblem-Solving: Strong analytical and problem-solving skills with excellent attention to detail.\n\nPreferred Qualifications:\n\nBachelor's or Master's degree in Computer Science, Engineering, or a related field.\n\nDeep Learning Frameworks: Exposure to deep learning frameworks such as TensorFlow or PyTorch.\n\nCloud Platforms: Familiarity with cloud services (AWS, Google Cloud Platform, or Azure), especially for deploying applications.\n\nContainerization: Knowledge of Docker and container orchestration tools is a plus.\n\nMLOps: Interest in or experience with MLOps principles and tools for managing the machine learning lifecycle.\n\nCommunication: Strong verbal and written communication skills and the ability to work effectively in a team environment.\n\nRedirect Notice",
        "job_url": "https://www.linkedin.com/jobs/view/4285712468/?eBP=BUDGET_EXHAUSTED_JOB&refId=uG1iR7Nhez072Janp8YyJQ%3D%3D&trackingId=6M5w4Z1hr6RfIxrhA9wcVQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python Developer",
        "company": "QAIN-Finity",
        "location": "Ahmedabad, Gujarat, India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nJob Title: Python Developer (Django/Flask)\n\n Location: Ahmedabad, Gujarat\n\n Employment Type: Full-time \n\n Experience: 2–5 years\n\n\nJob Overview\n\nWe are looking for a skilled Python Developer with strong experience in Django and Flask frameworks. The ideal candidate will design, develop, and maintain web applications, ensuring high performance, scalability, and security. You will work closely with cross-functional teams, including data scientists, designers, and other stakeholders, to deliver robust and efficient solutions.\n\n\nKey Responsibilities\nDevelop, maintain, and optimize web applications using Django and Flask.\nDesign and implement server-side logic and client-side functionalities.\nBuild, manage, and integrate RESTful APIs and third-party services.\nManage databases (design, queries, migrations) for optimal performance.\nImplement best security practices across applications.\nAutomate deployment processes and support CI/CD pipelines.\nCollaborate with data scientists, designers, and other team members to gather requirements, provide updates, and incorporate feedback.\nMonitor application performance and troubleshoot issues as needed.\n\nRequirements\nProven experience as a Python Developer with Django and Flask.\nStrong understanding of web application architecture and RESTful API design.\nHands-on experience with relational databases (PostgreSQL, MySQL) and ORM tools.\nKnowledge of front-end technologies (HTML, CSS, JavaScript) is a plus.\nFamiliarity with cloud platforms (AWS, GCP, Azure) and deployment automation tools.\nGood understanding of security best practices in web development.\nExcellent problem-solving skills and attention to detail.\nStrong communication and collaboration skills.\n\nPreferred Skills\nExperience with Docker and containerized applications.\nFamiliarity with Celery, Redis, or other task queues.\nUnderstanding of Agile/Scrum development methodologies.\nExposure to version control (Git) and code review processes.",
        "job_url": "https://www.linkedin.com/jobs/view/4281058437/?eBP=BUDGET_EXHAUSTED_JOB&refId=uG1iR7Nhez072Janp8YyJQ%3D%3D&trackingId=t0FtNzZ40f%2FqFB8orHE3lQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python AI Developer",
        "company": "AlongX Software",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nJob Title: Python AI Developer\n Company: AlongX Software (ISO 9001:2015 Certified Company)\n Location: Bangalore (Work From Office – 5 Days a Week)\n Joining Timeline: Within 15–20 Days\n Salary: As per Market Standards\n \n ---\n \n About AlongX Software\n \n AlongX Software is a forward-thinking technology company committed to delivering cutting-edge solutions that transform industries and create meaningful digital experiences. We value innovation, collaboration, and a passion for solving complex problems using modern technology.\n \n ---\n \n Role Overview\n \n We are seeking a highly skilled Python AI Developer to join our dynamic development team. The ideal candidate will have solid experience in developing AI-driven applications and a strong command of Python. You will be responsible for designing, developing, and deploying AI models and integrating them into functional applications.\n \n Experience with prompt engineering and leveraging AI tools such as ChatGPT or other large language models to build intelligent applications will be a strong advantage.\n \n ---\n \n Key Responsibilities\n \n Design, develop, and deploy AI-powered applications using Python.\n \n Work on integrating large language models (e.g., ChatGPT, OpenAI API, or similar) into applications.\n \n Utilize prompt engineering techniques to enhance AI output and application performance.\n \n Collaborate with cross-functional teams to understand requirements and deliver high-quality solutions.\n \n Optimize AI models for performance, scalability, and efficiency.\n \n Conduct research on emerging AI technologies and recommend best practices.\n \n Write clean, efficient, and maintainable code.\n \n ---\n \n Required Skills & Qualifications\n \n Proven experience in Python with strong knowledge of AI/ML concepts and frameworks (e.g., TensorFlow, PyTorch, Hugging Face, LangChain).\n \n Hands-on experience in developing and deploying AI-driven applications.\n \n Proficiency in working with AI APIs, chatbots, and generative AI solutions.\n \n Strong understanding of prompt engineering techniques for AI models.\n \n Ability to integrate AI functionalities into practical, user-friendly applications.\n \n Excellent problem-solving skills and attention to detail.\n \n Good communication and collaboration skills.\n \n ---\n \n Optional Skills (Good to Have)\n \n Experience with React.js or other modern JavaScript frameworks for front-end development.\n \n Knowledge of cloud platforms such as AWS, Azure, or Google Cloud for AI model deployment.\n \n ---\n \n Perks & Benefits\n \n Competitive salary as per market standards.\n \n Opportunity to work on cutting-edge AI projects.\n \n Collaborative and growth-oriented work environment.\n \n Professional development and skill-building opportunities.",
        "job_url": "https://www.linkedin.com/jobs/view/4283013270/?eBP=CwEAAAGYuTarRgSEQzTq6Wv3RVB_R8Pfssh6cvErD6TZhqWzpmCDZLtRzY2PpIGsnpMPSBT5uSBzT9rghbYqbWYQLgxq3ldNGMH8kvZYLAueaG5wPbxRjp-PIsJut3A8gfmcD4xXtpRDsA5MrxNxW3njXx0pWJZF7YRC3ZfMKhUTURLSW4ITla275jJbEANXTdcQWWvwsUuTPAeJ9rPIm9SIajCMwySa7wgvJ6lx4gqxOagVvZzUNvReQijKab7dMoEJy_LBDfUTm7pTBsn-rQQpxrXWBkRG7XUnLSPeJRgYwkz6VU5WilVPbaAGJuwy3xZd5a6ZhFng0Qh4KWMrUcaowHaYYzvcTiO5XGVv-hDnWeJzaDQS7IO7XO0DMYwuIA0e&refId=uG1iR7Nhez072Janp8YyJQ%3D%3D&trackingId=JXxDyv3b6pZsFQAyh2s%2FQA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python Developer",
        "company": "Applicantz",
        "location": "India",
        "date_posted": "3 days ago",
        "description": "About the job\n\nTHIS IS A LONG TERM CONTRACT POSITION WITH ONE OF THE LARGEST, GLOBAL, TECHNOLOGY LEADER. Candidate must be present in the Bangalore office for Hybrid work\n\n\n\n\nWe are looking for a skilled Python Developer to join our engineering team. The ideal candidate will have strong backend development experience and the ability to build scalable APIs and services using modern frameworks.\n\n\n\n\nRequired Skills\n\nProficiency in Python and frameworks like Django, Flask, or FastAPI\nStrong knowledge of SQL and databases (MySQL, PostgreSQL)\nExperience with REST API development and third-party integrations\nBasic knowledge of Docker and Git\nGood analytical thinking and communication skills\nExposure to cloud platforms (AWS, Azure)\nExperience with unit testing and CI/CD pipelines\n\n\n\n\nKey Responsibilities\n\nDevelop, test, and maintain Python applications and APIs.\nParticipate in technical discussions and code reviews\nCollaborate with product and engineering teams for solution delivery\nWrite clean, scalable, and well-documented code\nTroubleshoot development and production issues\nFollow agile practices and contribute to process improvements\n\n\n\n\nOur large, Fortune client is ranked as one of the best companies to work with, in the world. The client fosters progressive culture, creativity, and a Flexible work environment. They use cutting-edge technologies to keep themselves ahead of the curve. Diversity in all aspects is respected. Integrity, experience, honesty, people, humanity, and passion for excellence are some other adjectives that define this global technology leader.",
        "job_url": "https://www.linkedin.com/jobs/view/4285604035/?eBP=CwEAAAGYuTa0wZHxAAgA00bevGOg6wwq8BJ9lmiJI7zwbGor34idvMYQNBj6Pjbmjktyc-E-IVU8bbCCIvOn_tXiHndqdS21JXIegAm26WntUZmHVCJPVLsA_fdRvV8qr9ntXbzm_kp_UjleRp-pyiHgieOt7ZXg9kZTxJcsWXMlB1Y3GQE39FRvQi4rHmrTzQiQUe84oTjWtQm-0R8uU_qNZPkGIzB-2aV8IComNQTkJK_03F6Tu0V4dClex11NHqmZHqSyB-U92Oq5onXxWtUyKD0M_P0fpfjFWvwqJ2SjvaTSE7aZS94KS4EfI4wCyeB5-lIeYQPI62ZHENkfA4Zti6D3mDUFOBGeFTf8d9wIht6xp7EWDYMRgL0hpvLNhGG594O3xLaFitNNZ1sPvDr_Ltb6qFLumX22-5ZdVES2DuFxefDC7rTFVEITVbzh6mmfTvTmPBPvWWtnmaKDI9rwqxGkHIYECscfE8lhTk9UljP7QQbOiisASAOQ4lc4noQp8Lp6xkhc&refId=5baAgJQUaC67CJbctjPUXA%3D%3D&trackingId=%2B10NQUBNhRjy8bl2eDtkUQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Python Developer",
        "company": "Persistent Systems",
        "location": "Hyderabad, Telangana, India",
        "date_posted": "Be an early applicant",
        "description": "About the job\n\nAbout Persistent\n\nWe are an AI-led, platform-driven Digital Engineering and Enterprise Modernization partner, combining deep technical expertise and industry experience to help our clients anticipate what’s next. Our offerings and proven solutions create a unique competitive advantage for our clients by giving them the power to see beyond and rise above. We work with many industry-leading organizations across the world, including 12 of the 30 most innovative global companies, 60% of the largest banks in the US and India, and numerous innovators across the healthcare ecosystem.\n\nOur disruptor’s mindset, commitment to client success, and agility to thrive in the dynamic environment have enabled us to sustain our growth momentum by reporting $1,409.1M revenue in FY25, delivering 18.8% Y-o-Y growth. Our 23,900+ global team members, located in 19 countries, have been instrumental in helping the market leaders transform their industries. We are also pleased to share that Persistent won in four categories at the prestigious 2024 ISG Star of Excellence™ Awards , including the Overall Award based on the voice of the customer. We were included in the Dow Jones Sustainability World Index, setting high standards in sustainability and corporate responsibility. We were awarded for our state-of-the-art learning and development initiatives at the 16 th TISS LeapVault CLO Awards. In addition, we were cited as the fastest-growing IT services brand in the 2024 Brand Finance India 100 Report. Throughout our market-leading growth, we’ve maintained a strong employee satisfaction score of 8.2/10.\n\nAt Persistent, we embrace diversity to unlock everyone's potential. Our programs empower our workforce by harnessing varied backgrounds for creative, innovative problem-solving. Our inclusive environment fosters belonging, encouraging employees to unleash their full potential.\n\nFor more details please login to www.persistent.com\n\nAbout The Position\n\nWe are looking for an experienced Python Developer to join our engineering team and help us create dynamic software applications for our clients. You will be responsible for writing and testing scalable code, developing back-end components, and integrating user-facing elements in collaboration with front-end developers. To be successful in this role, you will require in-depth knowledge of object-relational mapping, experience with server-side logic, and above-average knowledge of Python programming. Ultimately, as a top-class Python Developer you should be able to design highly responsive web-applications that perfectly meet the needs of the client.\n\n What You?ll Do \n\n\n Write effective, scalable code \n Develop back-end components to improve responsiveness and overall performance \n Integrate user-facing elements into applications \n Test and debug programs \n Improve functionality of existing systems \n Implement security and data protection solutions \n Assess and prioritize feature requests \n Coordinate with internal teams to understand user requirements and provide technical solutions \n\n\n Expertise You?ll Bring \n\n\n A Bachelor of Science degree in Computer Science, Engineering or relevant field \n Work experience as a Python Developer \n Expertise in at least one popular Python framework (like Django, Flask or Pyramid) \n Knowledge of object-relational mapping (ORM) \n Familiarity with front-end technologies (like JavaScript and HTML5) \n Team spirit \n Good problem-solving skills \n\n\nBenefits\n\n\n Competitive salary and benefits package \n Culture focused on talent development with quarterly promotion cycles and company-sponsored higher education and certifications \n Opportunity to work with cutting-edge technologies \n Employee engagement initiatives such as project parties, flexible work hours, and Long Service awards \n Annual health check-ups \n Insurance coverage: group term life, personal accident, and Mediclaim hospitalization for self, spouse, two children, and parents \n\n\nPersistent Ltd. is dedicated to fostering diversity and inclusion in the workplace. We invite applications from all qualified individuals, including those with disabilities, and regardless of gender or gender preference. We welcome diverse candidates from all backgrounds.\n\nInclusive Environment\n\n\nWe offer hybrid work options and flexible working hours to accommodate various needs and preferences.\nOur office is equipped with accessible facilities, including adjustable workstations, ergonomic chairs, and assistive technologies to support employees with physical disabilities.\nIf you are a person with disabilities and have specific requirements, please inform us during the application process or at any time during your employment. We are committed to creating an inclusive environment where all employees can thrive.\n\n\nOur company fosters a values-driven and people-centric work environment that enables our employees to:\n\n\nAccelerate growth, both professionally and personally\nImpact the world in powerful, positive ways, using the latest technologies\nEnjoy collaborative innovation, with diversity and work-life wellbeing at the core\nUnlock global opportunities to work and learn with the industry’s best \n\n\nLet’s unleash your full potential at Persistent -  persistent.com/careers",
        "job_url": "https://www.linkedin.com/jobs/view/4217499837/?eBP=CwEAAAGYuTa0wXvp7xH4RNUCjDx6VccNi4oDVJERaYtbmMNgVmwh23KL5HmiXorPn_afBEhiHiALeApSrwP_Y8472BsxlLKHWiD5-Dd3puC19PMSl43mRAr70zOYccWcIcH46bE1GGtHug6TVpsUX_EDTKZDYQ33xBIVyhZb2dXRPoDj5Nnp14BhxVQmh-pE-SzMFcSTGFkXJ2qKW0ZB2Pf5zmTnR_IOzG6xzL8aJbWgOhwG4WsLmaiBE1zGN1uIbeyNYaV7D_uYFda8J3trQE2CMyYrgvjrqZg7xzd2yxZiPll3cF1stPO-oqO9Z-XLCa6NDHcJvWilmKhsC7s5Q_EvH4zI6eugGagm5C8QObuUZFl4GRDoCxP9XM1NgushSpVmviyVmbsSTv3wxhUUVYSsJg8N7qxbw-0fyDMmOikWfVNZvilwhJwlnGrGdjo82_k-f7fel0DyJ30JPKHmEYz7xiCik7jxvPzhJgWFlzDHxkBcWXSg8K2G2be6blknNPUe-9na2X9KZHk7AIyzFaA&refId=5baAgJQUaC67CJbctjPUXA%3D%3D&trackingId=FHqbOJyzQy%2BsbTMUjtH9%2Fg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Back End Developer",
        "company": "GoodSpace AI",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "4 days ago",
        "description": "About the job\n\nLocation: Remote\n\n\n\n\nEmployment Type: Full-Time\n\n\n\n\nWe are looking for a skilled and experienced Backend Developer to join our growing engineering team. You’ll be responsible for building and maintaining scalable backend systems that power real-world products used at scale. You will work closely with our product, frontend, and DevOps teams to deliver clean, high-performance code.\n\n\n\n\nResponsibilities:\n\n\n\n\n*Design and develop robust, secure, and scalable backend systems and APIs\n\n\n\n\n*Write clean, maintainable code using Node.js / Python / Java / Go\n\n\n\n\n*Work with SQL and NoSQL databases like PostgreSQL, MongoDB, Redis\n\n\n\n\n*Integrate third-party APIs and services\n\n\n\n\n*Optimize performance, reliability, and scalability\n\n\n\n\n*Contribute to architectural decisions and code reviews\n\n\n\n\n*Collaborate with cross-functional teams to deliver end-to-end solutions\n\n\n\n\n*Mentor junior developers and contribute to overall code quality\n\n\n\n\nRequirements:\n\n\n\n\n*Strong understanding of data structures, algorithms, and system design\n\n\n\n\n*Experience with microservices architecture and RESTful APIs\n\n\n\n\n*Familiarity with message queues (Kafka, RabbitMQ)\n\n\n\n\n*Hands-on experience with Docker and cloud platforms (AWS, GCP, or Azure)\n\n\n\n\n*Strong debugging and problem-solving skills\n\n\n\n\n*Passion for building clean, efficient, and scalable systems",
        "job_url": "https://www.linkedin.com/jobs/view/4284106350/?eBP=BUDGET_EXHAUSTED_JOB&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=ZKgd2smFRid4hmpENcb49w%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Backend Developer (Core Team Member)",
        "company": null,
        "location": "Kerala, India",
        "date_posted": "9 hours ago",
        "description": "About the job\n\nWe are seeking a Full-Time Backend Developer to join our core tech team. we need a backend expert to own the backend, build integrations with third-party platforms, and prepare the system for AI-powered features.\n\nThis is a foundational role – you will be one of the first hires in our backend tech team and play a key part in shaping the product’s architecture, scalability, and performance.\n\nResponsibilities\nBuild and maintain the backend architecture of our platform.\nDesign and manage APIs for frontend-backend communication.\nDevelop integrations with CRMs and external platforms.\nHandle user authentication, security, and token management.\nSet up databases for scalability and performance.\nManage cloud deployment (AWS, GCP, or Azure).\nCollaborate with frontend developer for seamless delivery.\nWork closely with the founders to bring AI features into production.\nSuggest improvements for efficiency, performance, and product direction.\nRequirements\nStrong skills in Node.js/Express.js or Python (Django/FastAPI/Flask).\nHands-on experience with databases (MySQL, PostgreSQL, MongoDB).\nSolid knowledge of OAuth 2.0 & third-party integrations.\nCloud deployment experience (AWS/GCP/Azure).\nFamiliarity with Git/GitHub workflows.\nAbility to take ownership and think long-term.\nNice-to-Have\nAI/ML integration exposure (NLP, sentiment analysis, automation).\nSaaS/CRM integration background.\nStartup/early-stage experience.\nWhat We Offer\nFull-time role (₹25,000–₹30,000 per month starting).\nRemote & flexible working.\nBe part of the core founding team of a growing tech product.\nCareer growth – future salary hikes and potential equity options.",
        "job_url": "https://www.linkedin.com/jobs/view/4287722255/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=fdW7sDV%2FNqnbhe%2FcAkEmEg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Backend Developer",
        "company": "Streak AI Technologies Pvt Ltd",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nJob Title: Backend Developer\n\nLocation: Bengaluru, Karnataka\n\nJob Type: Full-time\n\nCompany Description:\n\nJob Overview:\n\nWe are seeking a talented and experienced Backend Developer to join our team. The ideal candidate will have a strong background in software development and experience with backend technologies. You will work closely with our engineering team to design and implement scalable, reliable, and high-performance backend systems.\n\n\n\n\nResponsibilities:\n\nEnd to end engineering - design, develop, test, deploy, debug, maintain and improve the server-side applications and APIs.\nCollaborate with front-end developers to integrate user-facing elements with server-side logic.\nOptimize applications for maximum speed, scalability, and reliability.\nImplement security and data protection measures.\nWrite clean, efficient, and maintainable code following best practices and coding standards.\nPerform code reviews and provide constructive feedback to team members.\nTroubleshoot and debug issues as they arise.\nStay up-to-date with the latest backend development trends and technologies.\nManage individual projects priorities, deadlines, and deliverables\nBuild low latency microservices.\nWork on scaling services.\nParticipate first hand in system design and architecture discussions\n\n\n\n\nQualification:\n\n\n\n\n1-3 years of hands-on experience in developing applications\nExperience working in a fast-paced environment.\nNeed to be proficient in Golang and Python is an added advantage.\nStrong design skills involving data modeling and low-level class design\nKnowledge of best practices of working with large data sets and DB clusters.\nMust have a passion for tackling problems and building and managing scalable systems.\nExperience developing scalable and low latency microservices.\nExperienced in docker and deploying using CI/CD pipelines.\nUnderstanding of public cloud platforms like AWS, GCP\nHands-on experience of working with Databases and Linux/Unix platform\nUnderstanding of Micro-services architecture and associated design patterns etc.\nExperience working with caching (Redis), message queues, streaming services, web-sockets, SQL (clickhouse), and NoSQL (Mongo DB).\nExperience with scalable systems (techniques like replication, sharding)\nExperience with performance engineering (monitoring & actioning on application performance stats)\nGood to have: Experience with gRPC (HTTP2 Protocol buffers)\nGood to have: Experience with high-performance websites catering to millions requests.\nTroubleshoot and debug issues as they arise.\nStay up-to-date with the latest backend development trends and technologies.",
        "job_url": "https://www.linkedin.com/jobs/view/4282704149/?eBP=BUDGET_EXHAUSTED_JOB&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=eC9JWd89%2BEC8ClQtztpMuQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Backend Engineer ($20K - $40K)",
        "company": "CodeRound AI",
        "location": "Greater Bengaluru Area",
        "date_posted": "4 days ago",
        "description": "About the job\n\n🚀 What we’re building\nCodeRound AI matches top 5% tech talent to fastest growing VC funded AI startups in Silicon Valley and India. \nCandidates apply once and get UPTO 20 remote as well as onsite interview opportunities IF selected!\nTop-tier product startups in US, UK, EU, UAE & India have hired top engineers & ML folk using CodeRound\n\n\n\n\n🛠️ What you’ll do\nWork directly with the founding team to build our backend systems\nWrite clean, maintainable, and scalable code\nArchitect and ship new features end-to-end, fast.\nMake performance, data security, and user experience better every day.\nHelp shape our engineering culture and raise the bar.\n\n\n🚀 Why join us now?\nOwnership — You’ll own large chunks of product and backend.\nVelocity — We ship fast. No red tape. Just real work and real impact.\nCustomers love us — We’re not guessing. We’re scaling.\nLearning — Work with founders who’ve built and exited companies, and learn the ropes of building a startup from scratch.\nGrowth — If you're good, you’ll grow fast here — in role, scope, and compensation.\n\n\n🙌 You might be a great fit if you:\nHave 1+ years of backend experience (Python, Node, Go, or anything solid).\nCare deeply about building great products, not just writing code.\nAre excited by the chaos and clarity of startups.\nWant to grow fast by shipping real things.\nCan own problems end-to-end, and love making things better every week.\n\n\n⚡ Bonus points if you:\nLove clean APIs, background jobs, and writing code that runs in production without drama.\nHave side projects, contributions, or stories that show you're self-driven.",
        "job_url": "https://www.linkedin.com/jobs/view/4282201776/?eBP=BUDGET_EXHAUSTED_JOB&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=W650ImxosdWrWzSy0zvE6w%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Junior Software Engineer",
        "company": "Eqvista",
        "location": "Mumbai, Maharashtra, India",
        "date_posted": "2 days ago",
        "description": "About the job\n\nAbout Eqvista:\n\n\n\n\nAt Eqvista, we are committed to driving innovation and excellence in our industry. We believe that technology is a key enabler of our success, and we are looking for a talented IT Developer to join our dynamic team. We want to hear from you if you are passionate about technology, leadership, and strategic planning!\n\n\n\n\nEqvista stands out as a comprehensive solution for entrepreneurs looking to manage their company's equity efficiently. With its array of features tailored to meet the needs of startups and growing businesses, it simplifies complex tasks associated with share management and compliance.\n\nPlease visit: https://eqvista.com/ to learn more about our company.\n\nFor more open position, please visit: https://eqvista.com/careers/\n\n\n\n\nJob Description:\n\n\n\n\nAs a Junior Software Engineer, you will work closely with our experienced development team to design, develop, and maintain software applications. You will have the opportunity to learn from industry professionals, gain hands-on experience, and contribute to real-world projects.\n\n\n\n\nResponsibilities: \n\n\n\n\nCollaborate with team members to design and implement software solutions.\nWrite clean, maintainable, and efficient code.\nParticipate in code reviews and contribute to team best practices.\nAssist in troubleshooting and debugging applications.\nStay up-to-date with emerging technologies and industry trends.\nContribute to documentation and user manuals.\n\n\n\n\nQualifications:\n\n\n\n\nBachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\nFamiliarity with programming languages such as Java, Python, C#, or JavaScript.\nBasic understanding of web technologies (HTML, CSS, JavaScript) and frameworks (React, Angular, etc.) is a plus.\nKnowledge of database management systems (SQL or NoSQL).\nStrong problem-solving skills and attention to detail.\nExcellent communication and teamwork abilities.",
        "job_url": "https://www.linkedin.com/jobs/view/4282897827/?eBP=BUDGET_EXHAUSTED_JOB&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=IEwNFdguzKqmmZYW0yM6tw%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Backend Developer - PERN",
        "company": "TechBridge Consultancy Services",
        "location": "Gurugram, Haryana, India",
        "date_posted": "Actively reviewing applicants",
        "description": "About the job\n\nCompany Description\n\nTechBridge Consultancy Services is a leading provider of product and solutions in Network Monitoring, Cyber Security Applications, Collaboration, and Unified Communications. Our market-leading solutions in Network Modernization, Unified Communications, Mobility, and Embedded Communications empower customers to quickly capitalize on emerging market segments. We are experts in Government Solutions, Smart City Solutions, Data Centers, and Large Enterprises. TechBridge is ISO certified and committed to maintaining high standards.\n\n\n\n\n\n\n\nJob Summary:\n\n We are looking for a skilled PERN Developer with 2+ years of experience to design, develop, and maintain web applications using the PERN stack (PostgreSQL, Express.js, React.js, Node.js). In this role, you will be responsible for full-stack development, ensuring the delivery of high-quality, scalable, and efficient solutions. You will collaborate with cross-functional teams, troubleshoot complex issues, and adhere to best practices throughout the software development lifecycle.\n\n\n\n\nKey Responsibilities: \n\nDesign, develop, and maintain web applications using the PERN stack. \nBuild scalable and efficient backend APIs and services using Node.js and Express.js.\nDevelop interactive, responsive, and user-friendly frontends using React.js.\nWork with PostgreSQL to design database schemas, write queries, and ensure optimal database performance.\nTroubleshoot and debug application issues during development and post-production.\nCollaborate with product managers, UI/UX designers, and QA teams to deliver high-quality features.Conduct code reviews to ensure code quality and adherence to best practices.\nStay updated with the latest trends in web development and contribute to improving team processes.\nDocument technical specifications, system designs, and development workflows.\n\n\n\n\nSkills and Qualifications:\n\nBachelor’s degree in Computer Science, Engineering, or a related field.\n2+ years of experience as a full-stack developer using the PERN stack or similar technologies.\nProficient in JavaScript, with strong experience in React.js, Node.js, and Express.js.\nStrong understanding of relational databases, particularly PostgreSQL, and ability to write efficient queries.\nFamiliarity with version control systems (e.g., Git) and deployment tools.\nSolid knowledge of RESTful API design and integration.\nExperience with Agile/Scrum development methodologies.\nStrong problem-solving skills and ability to work in a fast-paced environment.\nExcellent communication and teamwork skills.\n\n\n\n\nPreferred Skills:\n\n\n\n\nKnowledge of cloud platforms (e.g., AWS, Azure, or Heroku) and CI/CD pipelines.\nExperience with containerization tools like Docker.\nFamiliarity with testing frameworks and tools (e.g., Jest, Mocha)\n\n\n\n\nWhy Join Us? \n\nWork on cutting-edge technologies in a dynamic and supportive environment.\n Opportunities for professional growth and skill enhancement.\n Collaborative culture with a focus on innovation and excellence",
        "job_url": "https://www.linkedin.com/jobs/view/4283399519/?eBP=BUDGET_EXHAUSTED_JOB&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=Y2%2FE3DyRyabACm5zx0DuPg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Backend Developer",
        "company": "FactWise",
        "location": "Mumbai Metropolitan Region",
        "date_posted": "5 days ago",
        "description": "About the job\n\nFactWise is a fully funded, early-stage b2b SaaS startup offering solutions to a global client base. The flagship product is an end-to-end S2P solution designed to transform procurement for product manufacturing companies across industries. Our singular focus is to create a truly distinctive procurement platform that delights users and provides sustainable positive impact to the organizations we serve. We achieve this by providing transparency and insights to leaders, streamlining and automating processes to improve efficiency, and driving bottom-line impact by unlocking savings potential.\n\nFactWise received funding from a US-based VC, and we are currently deploying our MVP to initial clients. With exciting sales conversations in advanced stages across Europe, US, India markets, we have strong relations with leading VC ﬁrms and a great journey ahead. Our core team has members from MIT, Stanford, McKinsey, Amazon US, and we’d love to be joined by passionate, hardworking self-starters looking to align their growth journey with ours.\n\nThe Role\n\nResponsibilities\n\nAs a member of the development group, you will be primarily responsible for the design, development, and maintenance of the product:\n\n\nHelp define and create Backend architecture and deployment using Python- Django-AWS in an agile environment with lots of ownership and active mentoring\nWork with the Product and Design teams to build new features to solve business problems and fill business needs\nParticipate in code reviews to create robust and maintainable code\nWork in an agile environment where quick iterations and good feedback are a way of life\nInteract with other stakeholders for requirement, design discussions and for adoption of new features\nCommunicate and coordinate with our support and professional services teams to solve customer issues\nHelp scale our platform as we expand our product across various markets and verticals globally \n\n\nIdeal Profile\n\n\nAs a young, fresh startup, we are hoping to be joined by self-starting, hardworking, passionate individuals who are committed to delivering their best, who can grow into future leaders of FactWise.\n\n\nWhat's on Offer?\n\n\nLeadership Role\nWork alongside & learn from best in class talent",
        "job_url": "https://www.linkedin.com/jobs/view/4283752508/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=2c6SyuR2bSrq9qt3qBJiOA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Backend Developer",
        "company": "Aditi India",
        "location": "Bengaluru, Karnataka, India",
        "date_posted": "6 days ago",
        "description": "About the job\n\nEssential Responsibilities:\nSoftware design, development, and maintenance of applications \nDevelopment using Java, J2EE, Hibernate, Spring, Spring boot, Microservices, Restful Webservices, PL/SQL\nDeveloping and executing unit / integration test cases and performing white box testing \nUnderstanding of best coding practices, adhere to all the software architectural and Security standards\nAssist, guide and troubleshoot with the Support team to resolve customer issues of technical nature\nWork with teams through Agile development practices \nParticipate with Functional discussions to understand requirements and deliver solutions that meets the needs\nParticipate in release coordination and communication to stakeholders\n \nTop must-have HARD skills: \nDevelopment using Java, J2EE, Hibernate, Spring, Spring boot, Microservices, Restful Webservices, PL/SQL \nWell verse with Junit implementation \n \nSoft skills required: \nStrong analytical and Influencing skills \nExcellent oral and written communication skills in English \nHigh energy, Customer Passion & attention to details \nAbility to operate in a fast-paced environment with a sense of urgency, ownership, and accountability \nAbility to explore open source libraries, eager to learn new technologies. \nStrong desire to experiment, use new tools and techniques \nAdaptable/Flexible: being open to change in response to new information, different or unexpected circumstances, and having the ability to navigate ambiguous situations \nGood interpersonal communication skills.\n \n#AditiIndia\n#25-21531",
        "job_url": "https://www.linkedin.com/jobs/view/4283195427/?eBP=BUDGET_EXHAUSTED_JOB&refId=Gv9bbWpBXRrmvHfwCf3o3A%3D%3D&trackingId=FBcYlrUJ72P1xfGk8dVsfQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Backend Developer",
        "company": "PivotRoots",
        "location": "Mumbai Metropolitan Region",
        "date_posted": "Be an early applicant",
        "description": "About the job\n\nThe Senior Developer (front, back-end or fullstack) has the ability to build programs or rich and responsive web pages with an eye for detial and desire to create polished UI.\n\n\n Works with developers to design algorithms and flowcharts.\n Produces clean, efficient code based on specifications.\n Integrates software components and third-party programs.\n Verifies and deploys programs and systems.\n Troubleshoots, debugs and upgrades existing software.\n Gathers and evaluates user feedback.\n Recommends and executes improvements.\n Creates technical documentation for reference and reporting.",
        "job_url": "https://www.linkedin.com/jobs/view/4275350664/?eBP=BUDGET_EXHAUSTED_JOB&refId=V36ezmLC7ScEWVhVZplJbg%3D%3D&trackingId=KaEgIq25eZuOaTutIY%2FIHg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "ARM Worldwide - Backend Developer - Java/Python/Node.js",
        "company": "#ARM Worldwide",
        "location": "Mumbai Metropolitan Region",
        "date_posted": "Be an early applicant",
        "description": "About the job\nThis job is sourced from a job board. Learn More\n\nRole Description\n\nThis is an on-site role for a Backend Developer located in Mumbai.\n\nThe Backend Developer will be responsible for developing and maintaining server-side web applications, ensuring high performance and responsiveness to requests from the front-end.\n\nDay-to-day tasks include writing code, optimizing server-side logic, managing database interactions, troubleshooting back-end issues, and collaborating with front-end developers to integrate elements.\n\nThe role requires strict adherence to project deadlines and the ability to work collaboratively in a fast-paced environment.\n\nQualifications\n\n\n Experience in server-side programming languages such as Java, Python, or Node.js\n Proficiency in database management systems like MySQL, PostgreSQL, or MongoDB\n Strong understanding of RESTful APIs and web services\n Knowledge of version control systems, particularly Git\n Ability to write efficient, testable, and reusable code\n Excellent problem-solving skills and attention to detail\n Strong communication and collaboration skills\n Prior experience in handling cloud platforms, such as AWS or Azure, is a plus\n Bachelor's degree in Computer Science, Engineering, or a related field\n\n\n(ref:hirist.tech)",
        "job_url": "https://www.linkedin.com/jobs/view/4287209285/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=V36ezmLC7ScEWVhVZplJbg%3D%3D&trackingId=rjVIZ4xTwb7j1aESFDiWbg%3D%3D&trk=flagship3_search_srp_jobs"
    }
]