[
    {
        "title": null,
        "company": null,
        "location": null,
        "date_posted": "1 day ago",
        "description": null,
        "job_url": "https://www.linkedin.com/jobs/view/4283044014/?trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Engineer",
        "company": "Virtusa",
        "location": "Bangalore Urban, Karnataka, India",
        "date_posted": "",
        "description": "About the job\n\nDeliver performance focused backend system solutions mostly in Java. Build and maintain new and existing applications using Java Object-Oriented software analysis and design\n\nSolid understanding of object oriented programming and data modelling\n\nExperience with networking, and distributed system\n\nExperience with and appreciation for automated testing\n\nExperience with cloud compute, virtualisation and automation, using Kubernetes and AWS\n\nPreferable if you have exposure with open-source applications, e.g. Cassandra and Apache Flink\n\nB.S./MS/PhD in Computer Science or related field or equivalent experience\n\nProven experience solving problems in complex domains\n\nProactively identify and manage risks, including assessing and controlling risks of various kinds and apply this appropriately to diverse situations\n\nDisplays courage and willing to always contribute constructive feedback not being afraid to highlight issues and challenges and bringing alternative solutions to the table\n\n\n\nDesired Skills and Experience\n\nSpring Boot",
        "job_url": "https://www.linkedin.com/jobs/view/4248402614/?eBP=CwEAAAGYs8VbQfuKCosEbnOO2FAzd2NMu7w4RkFvkPU2iKxHl4VBIdNw750zdOeHRZvkhAc1LL-jneIrANRtnDQ6FC14mN_ZetBZLoERcoLeuIBMbL_Ikfdlp3Or_jAwMoFQke-3T-96H7WoPYbzzi6vp-xLvOhYHOCMtVZkm5tVUkXfvrvpYdp9GUu0lAdaPjMcoe1_TjAXIkWsIltk9uMIq_gCqY_yOqhQO2K5s6kNYICPAkLbSnR_SA3zMUuCMkQ4kcnmpDkdC6cGTcPvGvrJQqtMDXjPz_txQubshFSmY4HajcZNrN9KyzEYrQ4_H_yQmMiWZEzd5ORX7rVRC0gpg96vbaYdkUHk5VUgYp2uzb4cecP8FN2CPt_U4pOU-DJDFFdilRclM0z8_QCKlsgnXD6iyXcscQ0p0MECDGzJClu18ZhX1Os2JsYcIrfXFxkhQ-AV_8vNUmJKD4gBOPVt2ZOUeAwNrVrip3VKWEyXRIBqbHUXOo9tIZECktPDqHUQqzP7JcM52SFYmPlKNTDUY5FQ_8idWQ&refId=pAnhT%2Bg%2FpZT4N66ptvt%2FHw%3D%3D&trackingId=auF1W6SKVrkZ4%2BoDZBN50Q%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java FSD Developer",
        "company": "Virtusa",
        "location": "Andhra Pradesh, India",
        "date_posted": "23 hours ago",
        "description": "About the job\n\nPrimary skills : REST API Proficient in developing RESTful APIs using Java Spring Boot. Proficiency in React.js for building and maintaining client-side applications. Strong experience with backend technologies like Java Spring Boot. Solid understanding of JavaScript, HTML, and CSS for modern web development. Experience in web application management, deployment, and release processes on Azure. Experience with version control systems (e.g., Git) and familiarity with Agile workflows . Experience understaing data base design and DB consumption by using SQL,Oracle, PostrgreSQL Solid understanding of software testing methodologies, including performance testing, (applicable when collaborating with QA teams). Proficiency in using bug tracking tools to ensure smooth development workflows. Strong problem-solving and communication skills for effective collaboration with cross-functional teams. In-depth knowledge of monitoring, logging, and performance tuning using tools. Knowledge on monitor tools.\n\n\n\nDesired Skills and Experience\n\nReact",
        "job_url": "https://www.linkedin.com/jobs/view/4283627047/?eBP=CwEAAAGYs8VbQsmeqpVRv6MsTifUH9U6jdbfdQDU_I1N-PB3HyQHJ2yW8nailBuyXs9uEl8NpTYeToJfeMWNSAlcAEzt61nEyWUBpDre5j2NvwlVA7Y6Np5TE_n4enaHJPSKFvdty_zlgZ00iCjwpwZHdvcph7kg66E8JrsrzWKxBnYuJLt9kR0XdgqKuOrTf6k1T2R_deaPu-hhNLQBgmDtvgjEmkwzf0HZk-iZlKjTbtm5qPZA8ZN88LiC0qI21jOgoUdikYPVggXkoGfPsg_QPRL3qCO5gLKYXKmF-hhUNbKf0tDSzRdAVt4ztD_yK2-tSvmBpVaAQDEuLGlsL2_RUCH0mnzqHqn41n_NzbFM0ms-llRxRPNfg4as4M3GTHMOc51OmTOKzuFT5Ktsx72VyWgYzqInaoE6LEfyVLXc0l589ZXl-knV--oIIUyt75k1OAktRIaTYRh5SLQ_e7GgvjQY3VLcT5KMkMQjGPr9IDAanZ4b8QrhUQ&refId=pAnhT%2Bg%2FpZT4N66ptvt%2FHw%3D%3D&trackingId=oAnf8q%2ByW4nXGdSseqGnZA%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Software Engineer IV - Java Backend developer",
        "company": "Candescent",
        "location": "Bengaluru East, Karnataka, India",
        "date_posted": "1 hour ago",
        "description": "About the job\n\nCandescent is the largest non-core digital banking provider. We bring together the transformative technologies that power and connect account opening, digital banking and branch solutions for banks and credit unions of all sizes on any core. Our Candescent solutions power the top three U.S. mobile banking apps and are trusted by banks and credit unions of all sizes.\n\nWe offer an extensive portfolio of industry-leading products and services with an extensible ecosystem of out-of-the-box and integrated partner solutions. In addition, our API-first architecture and developer tools enable financial institutions to optimize and expand upon their existing capabilities by seamlessly integrating custom-built or third-party solutions. And our connected in-person, remote and digital experiences reinvent customer service across all channels.\n\nSelf-service configuration and marketing tools give financial institutions greater control of their branding, targeted messaging and overall user experience. And data-driven analytics and reporting tools provide valuable insights to help drive continued growth and profitability. From conversions and implementations to custom development and customer care, our clients get expert, end-to-end support at every step.\n\nBachelor’s degree in computer science or equivalent, software engineering or proven work experience in related fields\n\n10 + years of experience developing and designing software applications using Java\n\nAPI First Mindset\n\nExpert understanding of core computer science fundamentals including data structures, algorithms, and concurrent programming\n\nExpert in analyzing, designing, implementing and troubleshooting software solutions for highly transactional systems.\n\nExpert in OOAD and design principals, implementing micro services architecture using JEE, Spring, Spring Boot, Spring Cloud, Hibernate, Oracle, PostgreSQL, NoSQL, Git, IntelliJ IDEA.\n\nExperience working in Native & Hybrid Cloud environment.\n\nExperience with Agile development methodology.\n\nExcellent communication and team player with can-do attitude.\n\nAbility to analyze user and business requirements to create technical design requirements and software architectureExperience must also include:\n\nJava\n\nJava IDE like Eclipse or IntelliJ\n\nJava EE Application servers like Apache Tomcat\n\nObject-oriented design, Git, Maven, and a popular scripting language\n\nApigee API Gateway\n\nExperience Agile Scrum methodologies\n\nExperience continuous integration systems like Jenkins or GitLab CI\n\nExperience with SAFe methodologies\n\nDeep knowledge and understanding to create secure solutions by design\n\nMulti-threaded backend environments with concurrent users\n\nEEO Statement\n\nIntegrated into our shared values is Candescent’s commitment to diversity and equal employment opportunity. All qualified applicants will receive consideration for employment without regard to sex, age, race, color, creed, religion, national origin, disability, sexual orientation, gender identity, veteran status, military service, genetic information, or any other characteristic or conduct protected by law. Candescent is committed to being a globally inclusive company where all people are treated fairly, recognized for their individuality, promoted based on performance and encouraged to strive to reach their full potential. We believe in understanding and respecting differences among all people. Every individual at Candescent has an ongoing responsibility to respect and support a globally diverse environment.\n\nStatement to Third Party Agencies\n\nTo ALL recruitment agencies: Candescent only accepts resumes from agencies on the preferred supplier list. Please do not forward resumes to our applicant tracking system, Candescent employees, or any Candescent facility. Candescent is not responsible for any fees or charges associated with unsolicited resumes.",
        "job_url": "https://www.linkedin.com/jobs/view/4284362931/?eBP=CwEAAAGYs8VbQo2xIcbPCvCqKVrSbA5Z9iuZ6zx6CUIao7mxOJdPCmcPJB8sAvjSjd8L1ltYqkZlazMjUMUkcU8PIRQIibIG1MnU6SITfMM99iXnb4GAg7L3bsYMmlthXNNLNpiBuwytItKRTiZnJN67_uAA4n4ZmiALZ59aIrLhdAaz5xhUjY4tjbpdpToZzRt_wuXYeOKr3_86HvjABOiNn3aZZHd5xstmSSDLkfAEhn_KXUbD8bIc0JAPexo1H1oWzvlpGn6rs4rVqHLqEhXUEsAFJV08B33Jx3uPiAom4YrOVFPjxezSKHtPji_hEe69Vp6Uy8i80iBZOcJdEHG9IDj2F2kQ_Ejj-85sAXhsR9HhygRFEAUW6vKriV3cn96ZM2v4W4NjG3JJJyGvZwZfHDcksewp2uy-1GKwPFmCXZej5mWdd75k2Lm1qEvTc_Hk9nHk8TRTGt7Orgl5jIRnNbnXtXSZVSjrN5dwZp6KVlihcxeU&refId=pAnhT%2Bg%2FpZT4N66ptvt%2FHw%3D%3D&trackingId=oPVqYXbSwx6ymy4d2nNb3g%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Navaera Worldwide - Specialist Java Developer - Spring MVC/J2EE Programming",
        "company": "Navaera Worldwide",
        "location": "Greater Vadodara Area",
        "date_posted": "16 hours ago",
        "description": "About the job\nThis job is sourced from a job board. Learn More\n\nAbout Navaera Worldwide\n\nNavaera Worldwide is a global, full-service firm specializing in advanced knowledge management products and services that empower financial organizations to enhance operational efficiency, manage risk, detect fraud, and gain a competitive edge. With headquarters in New York and offices in Toronto (Canada) and Baroda (India), Navaera delivers complex, enterprise-grade business products and technology solutions to diverse clients worldwide.\n\nRole Overview\n\nAs a Specialist Java Developer, you will be responsible for designing, developing, and maintaining high-performance, secure, and scalable Java-based applications. This role demands strong expertise in Java EE technologies, hands-on experience with industry-leading frameworks, and a proven ability to work on mission-critical enterprise applications, particularly within financial services.\n\nKey Responsibilities\n\nApplication Development & Maintenance : \n\n\n Design, implement, and maintain enterprise-grade Java applications.\n Contribute across all phases of the software development lifecyclerequirement analysis, design, coding, testing, deployment, and maintenance.\n Ensure high performance, scalability, and availability of applications.\n\n\nCode Quality & Testing\n\n\n Write clean, testable, and efficient code following best practices and coding standards.\n Create and maintain automated unit and integration tests.\n Debug, troubleshoot, and optimize applications to resolve performance and functional issues.\n\n\nDocumentation & Collaboration\n\n\n Maintain up-to-date technical documentation for code, APIs, and system architecture.\n Collaborate with cross-functional teams including Business Analysts, QA Engineers, and DevOps teams to deliver high-quality releases.\n\n\nContinuous Improvement\n\n\n Participate in architecture reviews and design discussions.\n Stay updated on emerging technologies and industry trends to recommend innovative solutions.\n\n\nTechnical Skills Mandatory\n\nCore Java : \n\n\n Java 8+ with strong understanding of concurrency, memory management, and multithreading.\n\n\nJava EE Technologies\n\n\n Servlets, JSP, Web Services (SOAP & REST).\n\n\nFrameworks\n\n\n Spring MVC, Spring Integration, Hibernate ORM.\n\n\nFrontend Integration\n\n\n JavaScript, CSS, Bootstrap, and responsive UI design integration with backend services.\n\n\nDesign Principles\n\n\n Strong grasp of Object-Oriented Design Principles, SOLID principles, and design patterns.\n\n\nTroubleshooting\n\n\n Excellent problem-solving skills and experience with performance profiling and debugging tools.\n\n\nPreferred Skills\n\nIntegration Frameworks : \n\n\n ActiveMQ, Metro-based Web Services, Secure Socket Communications, Web Service Security.\n\n\nApplication Servers\n\n\n Apache HTTP Server, Apache Tomcat, GlassFish.\n\n\nSearch Frameworks\n\n\n Lucene, Solr, or Elasticsearch for high-speed search functionalities.\n\n\nSecurity & Compliance\n\n\n Experience implementing secure coding practices, encryption, and authentication/authorization frameworks.\n\n\nAdditional Tools\n\n\n Familiarity with build tools (Maven/Gradle), version control (Git), and CI/CD pipelines (Jenkins).\n\n\nQualifications\n\n\n Bachelors or Masters degree in Computer Science, Information Technology, or a related field.\n Proven track record of delivering enterprise-grade applications.\n Strong analytical, debugging, and communication skills.\n\n\n(ref:hirist.tech)",
        "job_url": "https://www.linkedin.com/jobs/view/4287209276/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=pAnhT%2Bg%2FpZT4N66ptvt%2FHw%3D%3D&trackingId=qeZG44vBaY4nAAw8VcedQQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Full Stack Developer – Spring Boot | Vue.js | AWS",
        "company": "Otto Group one.O",
        "location": "Hyderabad, Telangana, India",
        "date_posted": "9 hours ago",
        "description": "About the job\n\n\n\n\n\nOSP India, now part of one.O.\n\n\n\n\n\n \n\n\nOSP India - Hyderabad Private Limited takes a significant step forward in its evolution by becoming part of Otto Group one.O, the new central, high-performance partner for strategy consulting and technology for the Otto Group. This strengthens our mission to deliver innovative IT solutions for commerce and logistics, combining experience, technology, and a global vision to lead the digital future.\n\n\n\n\n\nOSP India’s name transition\n\n\n \n\n\n\nOSP India will adopt the name Otto Group one.O in the future, following our headquarters' rebranding. We want to assure you that this brand name change will not affect your role, job security, or our company culture. This transition aligns us with our global teams in Germany, Spain, and Taiwan and enhances our collaboration moving forward\n\n\n \n\n\n\n\nRequirements\n\n\n\n\n\n\nWe are seeking skilled Developers to join our agile product team, with opportunities available for Frontend, Backend, or Full Stack specialization. The ideal candidate will work on scalable and cloud-native applications, contributing to the development and infrastructure of modern enterprise solutions.\n\n\n \n\n\n\nKey Responsibilities\n\n\n\nDesign, develop, and maintain scalable applications using Vue.js, TypeScript, Java (Spring Boot), and AWS Cloud.\n\nContribute to both frontend and backend development efforts (based on specialization).\n\nWork with infrastructure-as-code using Terraform to manage and deploy AWS resources.\n\nBuild and manage CI/CD pipelines using Git and GitHub Actions.\n\nCollaborate effectively within a cross-functional agile team environment.\n\nMaintain and optimize PostgreSQL databases and AWS S3 storage.\n\nWrite clean, testable, and efficient code.\n\nParticipate in code reviews, stand-ups, and sprint planning.\n\n\n \n\n\nMust-Have Skills\n\n\n\nProficiency in either:\n\nFrontend: Vue.js, TypeScript\n\nBackend: Java, Spring Boot, AWS, Postgres, S3\n\nExperience with Terraform for infrastructure automation.\n\nStrong understanding of agile methodologies and working within larger teams.\n\nFamiliarity with Git and GitHub Actions for version control and CI/CD.\n\n\n\n\nBenefits\n\n\n\nFlexible Working Hours: Support for work-life balance through adaptable scheduling.\n\nComprehensive Medical Insurance: Coverage for employees and families, ensuring access to quality healthcare.\n\n Hybrid Work Model: Blend of in-office collaboration and remote work opportunities, with four days a week in the office.\n\n\n\n\n\n\n\n\n\nDesired Skills and Experience\n\nJava, Spring boot, Vue.Js, Terraform",
        "job_url": "https://www.linkedin.com/jobs/view/4286848770/?eBP=BUDGET_EXHAUSTED_JOB&refId=pAnhT%2Bg%2FpZT4N66ptvt%2FHw%3D%3D&trackingId=OfQk8kp7hve0587GBJYweQ%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java AWS Developer",
        "company": "Virtusa",
        "location": "Andhra Pradesh, India",
        "date_posted": "",
        "description": "About the job\n\nWe are seeking a talented and experienced Java AWS Developer to join our engineering team. The ideal candidate will have a strong background in Java, Spring Boot, and microservices architecture, with practical experience in developing scalable, cloud-native applications using AWS. Proficiency in Kafka, REST APIs, and ElastiCache is essential for this role.\n\nDesign, develop, and maintain microservices-based applications using Java and Spring Boot.\n\nBuild and expose RESTful APIs for internal and external integration.\n\nImplement message-driven solutions using Apache Kafka.\n\nDevelop and deploy applications on AWS Cloud, ensuring scalability, performance, and security.\n\nUtilize ElastiCache to enhance application responsiveness and performance.\n\nCollaborate with cross-functional teams including product owners, architects, and QA engineers.\n\nParticipate in code reviews, technical discussions, and continuous improvement initiatives.\n\nTroubleshoot and resolve production issues in a timely manner.\n\n\n\nDesired Skills and Experience\n\nSpring Boot, Apache Kafka, AWS Lambda, AWS EC2, ECS, ELK, Cloudwatch, Agile Methodology, Docker, Java, Kubernetes, Microservices Architecture, REST API",
        "job_url": "https://www.linkedin.com/jobs/view/4232501489/?eBP=CwEAAAGYs8VbQgPuqj7Hkzf2IdO-bxv2onLdnxRlvLzmYXlFxbCyJ-NRns_Hjidz-AhTr2x_eExBDHUYdtJSxKzoNWc7t-uzCr5gZmaUPyQ_HtRRtNfca2cSqz5BYGaMoKF-imZp7G7zRr2Sg3niUabh75vpPUrFPip-0U500LWTr5wX0tuhlOekMQVzf3HcLI5y38oz_x_LUVXVdDcVHjucPLr41NWz6WbXoKv3jowcO9Fay0l9NM1ipqBz3ZwNS_6QQI9Z1GNGVo4X4C4y-UT1s7-6_v6fSos5Ycykk2zTJkhOLyNgVdghtMKck2dVPk1rjMlvzthGhjprosRwHKN8CuFpnMbS8RdiLGgf2wz9Tde6QOatRMz4BUxkcFN9-Qn_74ko9RBVaBbKQeTrD1EYmhnVXfqRV123ZG7hGym_BtBQfcnKEslIB_bzc1lBTtxBgqQuPDfzZFCnTe0ZfPyviN-Gkuvu9ouhf3o5pjX7dk6xO4xg&refId=pAnhT%2Bg%2FpZT4N66ptvt%2FHw%3D%3D&trackingId=R7kB3wXDRiXmfowl%2FQjOjg%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Senior Java Developer",
        "company": "Virtusa",
        "location": "Gurgaon, Haryana, India",
        "date_posted": "",
        "description": "About the job\n\nStrong experience in Building the web application using Java Spring Boot Build REST APIs and SDKs following best practices Flexibility to work on various platforms Skills Architecture and development of REST APIs and microservices Required Skills Should be excellent in Java Should be excellent in OOPS concepts\n\nJava Collections Should be excellent in Spring Boot Spring hibernate Should have good exposure to Hibernate or any other ORM Should have worked on REST API implementation and microservices implementation Having knowledge on Excel operations would be added advantage Nice to have skills Exposure to AWS Docker and Kubernetes Exposure to GraphQL Exposure to Splunk\n\n\n\nDesired Skills and Experience\n\nGraphQL, Kubernetes, Docker, Splunk, REST API, Spring Boot, Java",
        "job_url": "https://www.linkedin.com/jobs/view/4270181082/?eBP=CwEAAAGYs8VbQutVRCen0L8DhY_LZfMmWv7ZxYD0XPXmxYm_BTKTiz8OYXnazg6Z0550CfemsXbIkweqxtswBC4O0_TixO1c2W547XvY8do4oq2K2MJp0qMnQZ_kmrrP1YiWRiFhFcOHaXMHWRHVXsPvmwp-eEqgVcRF57DXVJxzlYkSqRlBwAEeHV2bbgM9S-8ZbQW7TRUML_sh8CJ1vQ-8GSBrL4qyEw0-0QHW2LZSwVQmP4cpcpEMiHewHnvIoPkGMegKqxahlPy7OufMJqg3Mt4fpGGn03RDkMPOwmudBwnVnUaWuvVm2h-y8f_NDfoVTZYBWTj6oL5dq4tKYKjwXQpzctv85IpU838tpR-CfoE_Vmb9S-r1xUml0tmG7dQEwfannLV1svctNJ3xuR6Zpyc6pHLDD_j8x7agwC_c6-RTlJrqd11pFRonNPssOcOQemINE_BBNEemjUMBNbx2P_po9NHzJ2t8NLhcrCHZikeC4Q&refId=pAnhT%2Bg%2FpZT4N66ptvt%2FHw%3D%3D&trackingId=K1SGnPJX2dAWEi1RUVOVgw%3D%3D&trk=flagship3_search_srp_jobs"
    },
    {
        "title": "Java Engineer",
        "company": "Virtusa",
        "location": "Bangalore Urban, Karnataka, India",
        "date_posted": "",
        "description": "About the job\n\nDeliver performance focused backend system solutions mostly in Java. Build and maintain new and existing applications using Java Object-Oriented software analysis and design\n\nSolid understanding of object oriented programming and data modelling\n\nExperience with networking, and distributed system\n\nExperience with and appreciation for automated testing\n\nExperience with cloud compute, virtualisation and automation, using Kubernetes and AWS\n\nPreferable if you have exposure with open-source applications, e.g. Cassandra and Apache Flink\n\nB.S./MS/PhD in Computer Science or related field or equivalent experience\n\nProven experience solving problems in complex domains\n\nProactively identify and manage risks, including assessing and controlling risks of various kinds and apply this appropriately to diverse situations\n\nDisplays courage and willing to always contribute constructive feedback not being afraid to highlight issues and challenges and bringing alternative solutions to the table\n\n\n\nDesired Skills and Experience\n\nSpring Boot",
        "job_url": "https://www.linkedin.com/jobs/view/4248400971/?eBP=CwEAAAGYs8VgC2d-LtOKYAow0Qcg8mAAkBJdWwIZjeBsspgG2kWNosLLzhoaVmc1yMt89yAzqqyl_02-qL3zuJ2-Gs-g29ZGMjt4Gt8RXn3-CIGWK7kshkZdUQfsnbIxmY9yHDyouU6Evt9GawKxo0_1EO4ViuWyKs3sNaHtbJX05gMOHoMYeVE-iwn7rGUKR2yMsNcVDJ8KlvF0wDidKxNUCtph2BLDP3lQ38QgLWQrGYQ_XsXTCfulbOSycEfQIG2jjGIJcp6BLJOa2AXFDsCVZjNYuiFuGfjJmsJZUlel90_l6-ubvnj3c_kSpFKGYWZCdg_5AAjbMpt0av3t5OuEp-SusM0VfgClBmH-QzcsSml4LU5i-PI2AOUr9RDRbb2-CvBerpDjFF6RMcDTfXPox6lArZ-oFPyV8Q2O8FXEdnQYO8sNmQ-HYnkaolZ_mGqdLtOInvVeXgAVwFWI6vJ_iupYJL4VWGJ60KDakV5ZHMT2hka9g8PT6DUXq1pkW-PUouwSIvJ-QkNwW2vh8VZ3hw&refId=XYS6lonZyS3un5MVKcEgOg%3D%3D&trackingId=ANwhltFVmu2KzLw8wqQqQQ%3D%3D&trk=flagship3_search_srp_jobs"
    }
]